$(function(){
    var mns = {
    	//kilr=キラー, mlb=マルチブースト
		986:{'nm':'八界蛇神・ヤマタノオロチ','main':2,'sub':2, 'hp':4590, 'atk':1150, 're':222, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'mzr': 1, '2way': 2}},
		1112:{'nm':'宿業の破壊神・シヴァ','main':1,'sub':2, 'hp':4131, 'atk':1452, 're':125, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hir': 2, 'yb': 1}},
		1113:{'nm':'破戒の創造神・シヴァ','main':1,'sub':5, 'hp':3331, 'atk':1802, 're':125, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hir': 2, 'yb': 1}},
		1127:{'nm':'アンジェリウス','main':4,'sub':4, 'hp':2750, 'atk':1108, 're':518, 'aw':{'re': 1, 'skb': 1, 'hkr': 1}},
		1201:{'nm':'シンジ&カヲル&第13号機・FI','main':2,'sub':5, 'hp':3070, 'atk':2015, 're':198, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'mzr': 1, '2way': 1}},
		1203:{'nm':'ミサト&AAAヴンダー・主機点火','main':1,'sub':4, 'hp':2395, 'atk':1780, 're':282, 'aw':{'birs': 1, 'skb': 1, 'hir': 1, '2way': 1}},
		1206:{'nm':'五機龍合体・ゴッドカノープス','main':3,'sub':4, 'hp':4326, 'atk':1602, 're':179, 'aw':{'re': 1, 'skb': 1, 'kir': 1, '2way': 1}},
		1207:{'nm':'五機龍融合・デモンハダル','main':5,'sub':1, 'hp':4318, 'atk':1709, 're':98, 'aw':{'ymr': 1, 're': 1, 'skb': 1, '2way': 1}},
		1217:{'nm':'神書の管理者・メタトロン','main':4,'sub':2, 'hp':2454, 'atk':1330, 're':863, 'aw':{'birs': 2, 're': 1, 'skb': 2, 'bire': 1}},
		1262:{'nm':'天樹華の朱雀・レイラン','main':1,'sub':3, 'hp':3335, 'atk':1477, 're':352, 'aw':{'kilr': 2, 'hir': 1, 'hk': 1, 'hi': 1, 'ki': 1}},
		1263:{'nm':'天聖導の朱雀・レイラン','main':1,'sub':4, 'hp':2935, 'atk':1807, 're':272, 'aw':{'skb': 1, 'hir': 1, 'hkr': 1, 'hk': 1, 'hi': 1, 'ki': 1, '2way': 1}},
		1264:{'nm':'守護命の青龍・カリン','main':2,'sub':3, 'hp':3345, 'atk':1581, 're':284, 'aw':{'kilr': 2, 'ym': 1, 'mzr': 1, 'ki': 1, 'mz': 1}},
		1265:{'nm':'妙霊護の青龍・カリン','main':2,'sub':5, 'hp':4005, 'atk':1401, 're':194, 'aw':{'ymr': 1, 'skb': 1, 'ym': 1, 'mzr': 1, 'ki': 1, '2way': 1, 'mz': 1}},
		1266:{'nm':'冥地鎮の玄武・メイメイ','main':3,'sub':5, 'hp':3525, 'atk':1524, 're':266, 'aw':{'kilr': 2, 'ym': 1, 'kir': 1, 'hk': 1, 'ki': 1}},
		1267:{'nm':'道明守の玄武・メイメイ','main':3,'sub':4, 'hp':3475, 'atk':1414, 're':346, 'aw':{'skb': 1, 'ym': 1, 'hkr': 1, 'kir': 1, 'hk': 1, 'ki': 1, '2way': 1}},
		1268:{'nm':'焔月輪の白虎・ハク','main':5,'sub':1, 'hp':3353, 'atk':1491, 're':309, 'aw':{'kilr': 2, 'ymr': 1, 'ym': 1, 'hi': 1, 'mz': 1}},
		1269:{'nm':'退魔爪の白虎・ハク','main':5,'sub':5, 'hp':3293, 'atk':1741, 're':179, 'aw':{'ymr': 2, 'skb': 1, 'ym': 1, 'hi': 1, '2way': 1, 'mz': 1}},
		1279:{'nm':'ヨウ&カイゼルジークフリート','main':2,'sub':2, 'hp':3020, 'atk':1419, 're':342, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'mzr': 1, 'yb': 1, 'mz': 1}},
		1281:{'nm':'チカ&戦女神・ミネルヴァ','main':1,'sub':1, 'hp':2805, 'atk':1058, 're':500, 'aw':{'skb': 2, 'hir': 2, 'hi': 1, 'mlb': 1}},
		1283:{'nm':'ムラクモ&剛腕の巨人・ギガンテス','main':1,'sub':1, 'hp':3158, 'atk':1623, 're':56, 'aw':{'skb': 1, 'hir': 1, 'dk': 2, 'hi': 1, 'mlb': 1}},
		1285:{'nm':'リオナ&大海の歌姫・セイレーン','main':2,'sub':2, 'hp':2685, 'atk':1182, 're':436, 'aw':{'re': 2, 'skb': 1, 'mzr': 1, 'mlb': 1, 'mz': 1}},
		1287:{'nm':'フォーレン&狩猟神・アルテミス','main':3,'sub':3, 'hp':2328, 'atk':1259, 're':524, 'aw':{'skb': 2, 'kir': 2, 'mlb': 1, 'ki': 1}},
		1289:{'nm':'パトリシア&ヴァルキリー','main':4,'sub':4, 'hp':3595, 'atk':1198, 're':180, 'aw':{'skb': 1, 'hkr': 1, 'hk': 1, 'mlb': 1, 'gls': 2}},
		1291:{'nm':'アンリ&カオスデビルドラゴン','main':5,'sub':5, 'hp':2400, 'atk':1231, 're':511, 'aw':{'ymr': 2, 'skb': 2, 'ym': 1, 'mlb': 1}},
		1296:{'nm':'岩戸の芸女神・アメノウズメ','main':1,'sub':1, 'hp':2645, 'atk':1575, 're':501, 'aw':{'kilr': 2, 're': 2, 'hir': 1, 'hi': 1}},
		1299:{'nm':'天道の皇祖神・イザナギ','main':4,'sub':4, 'hp':4245, 'atk':1466, 're':325, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'ht': 1, 'hk': 3, '2way': 1}},
		1300:{'nm':'漫遊の国造神・オオクニヌシ','main':5,'sub':5, 'hp':5045, 'atk':1269, 're':54, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'ym': 2, 'yb': 1}},
		1301:{'nm':'ディノライダー・ワイルドドレーク','main':1,'sub':3, 'hp':2702, 'atk':1960, 're':80, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, 'kir': 1, 'ht': 1, '2way': 2}},
		1302:{'nm':'ビーストライダー・ウィズマーリン','main':2,'sub':1, 'hp':2653, 'atk':1951, 're':102, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, 'mzr': 1, 'ht': 1, '2way': 2}},
		1303:{'nm':'マリンライダー・バードロビン','main':3,'sub':2, 'hp':2641, 'atk':1942, 're':96, 'aw':{'huin': 1, 'skb': 1, 'mzr': 1, 'kir': 1, 'ht': 1, '2way': 2}},
		1304:{'nm':'ドラゴンライダー・キングアーサー','main':4,'sub':5, 'hp':2906, 'atk':1857, 're':72, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'hkr': 1, 'ht': 1, '2way': 2}},
		1305:{'nm':'グリプスライダー・ベクターフィン','main':5,'sub':4, 'hp':2850, 'atk':1876, 're':86, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'hkr': 1, 'ht': 1, '2way': 2}},
		1344:{'nm':'龍剣の勝利神・フレイ','main':1,'sub':4, 'hp':3355, 'atk':1402, 're':437, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hir': 2, 'ht': 1}},
		1345:{'nm':'永久の双星神・イズン&イズーナ','main':2,'sub':4, 'hp':2805, 'atk':1332, 're':649, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'mzr': 2, 'ht': 1}},
		1346:{'nm':'煌樹の豊麗神・フレイヤ','main':3,'sub':4, 'hp':3035, 'atk':1365, 're':560, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'kir': 2, 'ht': 1}},
		1347:{'nm':'奪還の雷戦神・トール','main':4,'sub':3, 'hp':2813, 'atk':1800, 're':374, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hkr': 2, 'ht': 1}},
		1348:{'nm':'暗躍の狡知神・ロキ','main':5,'sub':2, 'hp':3018, 'atk':1442, 're':527, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 1, 'ht': 1}},
		1352:{'nm':'フォレストバーン','main':3,'sub':3, 'hp':3140, 'atk':1359, 're':243, 'aw':{'skb': 1, 'kir': 1, 'jm': 1}},
		1371:{'nm':'獄羅苦狂魔皇・ベルゼブブ','main':5,'sub':5, 'hp':2473, 'atk':2115, 're':250, 'aw':{'birs': 1, 'skb': 2, 'ym': 1, 'dk': 1, 'gls': 1, '2way': 2}},
		1423:{'nm':'光槍の魔術神・オーディン','main':3,'sub':4, 'hp':4299, 'atk':1303, 're':548, 'aw':{'birs': 2, 're': 4, 'skb': 2}},
		1425:{'nm':'決死の燕将軍・張飛','main':3,'sub':1, 'hp':3335, 'atk':1640, 're':0, 'aw':{'birs': 1, 'skb': 1, '2way': 1}},
		1435:{'nm':'青銅聖闘士・鳳凰星座の一輝','main':1,'sub':5, 'hp':1293, 'atk':2363, 're':464, 'aw':{'ymr': 2, 'birs': 2, 'skb': 1, 'hir': 2}},
		1505:{'nm':'ウォータードラゴンナイト','main':2,'sub':2, 'hp':2368, 'atk':1215, 're':286, 'aw':{'birs': 2, 'skb': 1, '2way': 1}},
		1532:{'nm':'覚醒ゼウス・マーキュリー','main':2,'sub':4, 'hp':2525, 'atk':1702, 're':500, 'aw':{'mzr': 1, '2way': 1, 'mz': 1}},
		1552:{'nm':'天滅の神魔王・ルシファー','main':5,'sub':1, 'hp':2678, 'atk':1406, 're':554, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 2}},
		1553:{'nm':'創獄の神魔王・ルシファー','main':5,'sub':5, 'hp':2078, 'atk':1706, 're':554, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 2}},
		1555:{'nm':'八相龍神・ヤマタノオロチ','main':2,'sub':1, 'hp':3830, 'atk':1390, 're':222, 'aw':{'skb': 2, 'mzr': 2, '2way': 2}},
		1556:{'nm':'斬魔閃神・スサノオノミコト','main':3,'sub':4, 'hp':2200, 'atk':1836, 're':438, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'ki': 1, '2way': 1}},
		1557:{'nm':'焔天舞神・アマテラスオオカミ','main':4,'sub':1, 'hp':2721, 'atk':1511, 're':502, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, '2way': 1}},
		1558:{'nm':'超サイヤ人3・孫悟空','main':1,'sub':4, 'hp':3958, 'atk':1504, 're':203, 'aw':{'birs': 2, 'skb': 2, 'hir': 1, 'hkr': 1, '2way': 1}},
		1559:{'nm':'アルティメット孫悟飯','main':2,'sub':4, 'hp':3370, 'atk':1504, 're':352, 'aw':{'huin': 1, 'skb': 2, 'mzr': 1, 'hkr': 1, 'yb': 1, '2way': 1}},
		1560:{'nm':'超サイヤ人・破壊王子ベジータ','main':5,'sub':4, 'hp':2578, 'atk':2005, 're':204, 'aw':{'ymr': 1, 'skb': 2, 'hkr': 1, 'yb': 1, '2way': 2}},
		1561:{'nm':'超サイヤ人第三段階・トランクス','main':2,'sub':4, 'hp':2968, 'atk':2144, 're':0, 'aw':{'huin': 1, 'skb': 2, 'mzr': 1, 'hkr': 1, '2way': 2}},
		1615:{'nm':'猛炎の魔道士・ライラ','main':1,'sub':1, 'hp':2025, 'atk':1436, 're':511, 'aw':{'huin': 1, 'kilr': 2, 'skb': 1, 'hir': 1, '2way': 1}},
		1617:{'nm':'錬水の魔道士・シャロン','main':2,'sub':2, 'hp':2065, 'atk':1417, 're':511, 'aw':{'huin': 1, 'kilr': 2, 'skb': 1, 'mzr': 1, '2way': 1}},
		1619:{'nm':'神木の魔道士・リーザ','main':3,'sub':3, 'hp':2045, 'atk':1409, 're':518, 'aw':{'huin': 1, 'kilr': 2, 'skb': 1, 'kir': 1, '2way': 1}},
		1621:{'nm':'閃光の魔道士・レイ=シリウス','main':4,'sub':4, 'hp':2133, 'atk':1418, 're':504, 'aw':{'huin': 1, 'kilr': 2, 'skb': 1, '2way': 2}},
		1623:{'nm':'冥闇の魔道士・ディル=シリウス','main':5,'sub':5, 'hp':2118, 'atk':1429, 're':500, 'aw':{'huin': 1, 'kilr': 2, 'birs': 2, 'skb': 1, '2way': 2}},
		1645:{'nm':'絶世の紅龍喚士・ソニア','main':1,'sub':5, 'hp':3297, 'atk':1925, 're':165, 'aw':{'ymr': 1, 'skb': 2, 'bire': 1, 'hir': 1, 'yb': 1}},
		1705:{'nm':'永世の魔術師・ウィジャス','main':3,'sub':3, 'hp':2213, 'atk':1054, 're':504, 'aw':{'kilr': 2, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 2}},
		1707:{'nm':'黄昏の魔術師・チェスター','main':1,'sub':1, 'hp':2605, 'atk':1410, 're':172, 'aw':{'huin': 3, 'kilr': 2, 'skb': 1, 'yb': 1, '2way': 1}},
		1723:{'nm':'黄金聖闘士・天秤座の童虎','main':3,'sub':4, 'hp':3530, 'atk':1454, 're':347, 'aw':{'kilr': 1, 'skb': 1, 'yb': 1, 'ki': 2, '2way': 2}},
		1724:{'nm':'託されし魂・龍星座の紫龍','main':3,'sub':4, 'hp':3365, 'atk':1509, 're':124, 'aw':{'skb': 1, 'kir': 2, 'yb': 1, 'ki': 2}},
		1725:{'nm':'黄金の一矢・射手座の星矢','main':4,'sub':4, 'hp':3573, 'atk':1532, 're':412, 'aw':{'skb': 1, 'gls': 1, '2way': 4}},
		1726:{'nm':'覚醒ヒノカグツチ','main':1,'sub':5, 'hp':4520, 'atk':1660, 're':91, 'aw':{'huin': 1, 're': 1, 'skb': 1, 'hir': 1, 'ym': 1, 'hi': 1, '2way': 3}},
		1727:{'nm':'神命姫神・ヴァルキリーローズ','main':4,'sub':3, 'hp':2308, 'atk':1589, 're':656, 'aw':{'skb': 1, 'hp': 1, 'ht': 1, 'hk': 2, '2way': 1}},
		1728:{'nm':'凰華姫神・ヴァルキリーファム','main':1,'sub':4, 'hp':2508, 'atk':1589, 're':656, 'aw':{'skb': 1, 'hir': 2, 'ht': 1, '2way': 2}},
		1729:{'nm':'蒼翔姫神・ヴァルキリーレイン','main':2,'sub':4, 'hp':2508, 'atk':1589, 're':656, 'aw':{'skb': 1, 'mzr': 2, 'ht': 1, '2way': 2}},
		1730:{'nm':'茨戒姫神・ヴァルキリーエリーゼ','main':3,'sub':5, 'hp':2508, 'atk':1589, 're':656, 'aw':{'skb': 1, 'kir': 2, 'ht': 1, '2way': 2}},
		1731:{'nm':'黒翼姫神・ヴァルキリークレール','main':5,'sub':1, 'hp':2708, 'atk':1489, 're':656, 'aw':{'ymr': 2, 'skb': 1, 'ht': 1, '2way': 2}},
		1737:{'nm':'澪王妃・ヘラ・イース','main':2,'sub':2, 'hp':3504, 'atk':1534, 're':428, 'aw':{'re': 2, 'skb': 1, 'mzdec': 1, 'mz': 2}},
		1738:{'nm':'覇征の龍武王・曹操','main':1,'sub':3, 'hp':3295, 'atk':1956, 're':27, 'aw':{'huin': 1, 'skb': 2, 'hir': 1, 'hi': 1, '2way': 2}},
		1739:{'nm':'統覇の武王神・曹操','main':1,'sub':5, 'hp':3195, 'atk':1906, 're':107, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hir': 2, 'hi': 1}},
		1740:{'nm':'勇壮の将軍神・孫権','main':2,'sub':4, 'hp':2795, 'atk':1283, 're':580, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'mzr': 1, 'gls': 1, 'mz': 1}},
		1741:{'nm':'雄飛の龍将軍・孫権','main':2,'sub':3, 'hp':2695, 'atk':1183, 're':650, 'aw':{'skb': 1, 'mzr': 2, 'yb': 1, 'gls': 1, '2way': 1, 'mz': 1}},
		1742:{'nm':'護誓の英帝神・劉備','main':3,'sub':4, 'hp':2525, 'atk':1745, 're':403, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'kir': 1, 'jm': 1, 'ki': 1}},
		1743:{'nm':'克己の龍英傑・劉備','main':3,'sub':1, 'hp':2625, 'atk':1705, 're':353, 'aw':{'skb': 1, 'kir': 1, 'jm': 1, 'ki': 1, '2way': 3}},
		1744:{'nm':'天禄の龍聖姫・大喬','main':4,'sub':4, 'hp':2715, 'atk':1221, 're':641, 'aw':{'huin': 1, 'skb': 1, 'bire': 1, 'hkr': 2, 'yb': 1, '2way': 1}},
		1745:{'nm':'天奏の聖華神・小喬','main':4,'sub':2, 'hp':2865, 'atk':1321, 're':541, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'mzr': 1, 'hkr': 1, 'yb': 1}},
		1747:{'nm':'綺羅の秘女神・カーリー','main':4,'sub':1, 'hp':3015, 'atk':1411, 're':633, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 2}},
		1748:{'nm':'覚醒ハーデス','main':5,'sub':3, 'hp':2471, 'atk':2160, 're':396, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'ym': 1, 'gls': 2, 'ki': 1, '2way': 2}},
		1756:{'nm':'煌灯の魔導姫・アルス=ノウァ','main':4,'sub':1, 'hp':2610, 'atk':1714, 're':149, 'aw':{'skb': 1, 'hk': 4, 'hi': 2}},
		1758:{'nm':'闇翔の魔導姫・ゴエティア','main':5,'sub':3, 'hp':3508, 'atk':1312, 're':120, 'aw':{'skb': 1, 'ym': 4, 'ki': 2}},
		1839:{'nm':'雷天の頑龍王・ガイノウト','main':1,'sub':4, 'hp':4283, 'atk':1615, 're':120, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 1, 'hi': 3, 'mlb': 1}},
		1841:{'nm':'大弯の海龍王・ヴォルスーン','main':2,'sub':1, 'hp':4071, 'atk':1812, 're':65, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 2, '2way': 1, 'mz': 2}},
		1843:{'nm':'玻璃の風龍王・リンシア','main':3,'sub':5, 'hp':3340, 'atk':1678, 're':360, 'aw':{'huin': 1, 're': 3, 'skb': 1, 'yb': 1, 'mlb': 1, '2way': 1}},
		1845:{'nm':'解放の騎龍王・ノルディス','main':4,'sub':3, 'hp':3610, 'atk':1454, 're':389, 'aw':{'huin': 1, 'skb': 2, 'hkr': 2, 'kir': 2, 'yb': 1}},
		1847:{'nm':'黒天の幻龍王・ゼローグ∞','main':5,'sub':2, 'hp':4085, 'atk':1625, 're':305, 'aw':{'huin': 1, 'skb': 2, 'ym': 3, 'yb': 1, '2way': 1}},
		1848:{'nm':'密命の天使・イーリア','main':4,'sub':4, 'hp':2651, 'atk':1523, 're':614, 'aw':{'huin': 1, 'skb': 1, 'ymdec': 2, '2way': 2}},
		1849:{'nm':'忘却の死神・グリザル','main':5,'sub':5, 'hp':3047, 'atk':2013, 're':201, 'aw':{'huin': 1, 'ymr': 2, 'skb': 1, 'hkdec': 2}},
		1881:{'nm':'双曲剣の勇士・ショーテル','main':1,'sub':3, 'hp':2916, 'atk':1719, 're':221, 'aw':{'skb': 2, 'mlb': 1, '2way': 2}},
		1882:{'nm':'両刃剣の勇士・クレイモア','main':2,'sub':1, 'hp':2601, 'atk':1750, 're':300, 'aw':{'skb': 2, 'mlb': 1, '2way': 2}},
		1883:{'nm':'無銘刀の勇士・正宗','main':3,'sub':2, 'hp':2304, 'atk':2006, 're':251, 'aw':{'skb': 2, 'mlb': 1, '2way': 2}},
		1884:{'nm':'曲刃剣の勇士・コピス','main':4,'sub':1, 'hp':3101, 'atk':1708, 're':188, 'aw':{'skb': 2, 'mlb': 1, '2way': 2}},
		1885:{'nm':'巨重剣の勇士・ツヴァイハンダー','main':5,'sub':2, 'hp':4002, 'atk':1852, 're':271, 'aw':{'skb': 2, 'mlb': 1, '2way': 2}},
		1897:{'nm':'アースドラゴンナイト','main':3,'sub':3, 'hp':2260, 'atk':1255, 're':294, 'aw':{'birs': 2, 'skb': 1, '2way': 1}},
		1899:{'nm':'シャドウドラゴンナイト','main':5,'sub':5, 'hp':2350, 'atk':1295, 're':242, 'aw':{'birs': 2, 'skb': 1, '2way': 1}},
		1902:{'nm':'究極装備・シーフ','main':3,'sub':5, 'hp':2820, 'atk':1518, 're':483, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, 'ki': 1, '2way': 2}},
		1903:{'nm':'究極装備・時魔道士','main':4,'sub':4, 'hp':2633, 'atk':1315, 're':668, 'aw':{'huin': 1, 'skb': 1, 'yb': 3}},
		1904:{'nm':'究極装備・狩人','main':1,'sub':5, 'hp':2280, 'atk':1748, 're':218, 'aw':{'skb': 1, 'yb': 1, 'hi': 1, '2way': 1}},
		1906:{'nm':'究極装備・フェンサー','main':5,'sub':5, 'hp':2505, 'atk':1375, 're':395, 'aw':{'ymr': 1, 'skb': 1, 'ym': 1, '2way': 1}},
		1923:{'nm':'相思の天界神・ゼウス&ヘラ','main':4,'sub':5, 'hp':3965, 'atk':1361, 're':362, 'aw':{'re': 2, 'skb': 3, 'ym': 1, 'hk': 1, '2way': 1}},
		1924:{'nm':'怪盗キッド','main':4,'sub':5, 'hp':2621, 'atk':1203, 're':301, 'aw':{'yb': 1, 'hk': 3, 'gls': 5}},
		1925:{'nm':'魔槍の秘術神・オーディン','main':2,'sub':5, 'hp':4531, 'atk':1291, 're':548, 'aw':{'skb': 3, 'mzr': 3, '2way': 3}},
		1926:{'nm':'破天の雷霆龍・インドラ','main':4,'sub':4, 'hp':3450, 'atk':1467, 're':319, 'aw':{'huin': 2, 'skb': 1, 'hkr': 2, 'yb': 1}},
		1927:{'nm':'深獄の暗黒龍・ヴリトラ','main':5,'sub':5, 'hp':3867, 'atk':1625, 're':111, 'aw':{'huin': 1, 'ymr': 3, 'skb': 2}},
		1928:{'nm':'覚醒ヴィーナス','main':4,'sub':2, 'hp':3075, 'atk':1436, 're':645, 'aw':{'huin': 1, 're': 2, 'skb': 1, 'hkr': 3, 'hk': 1, '2way': 1}},
		1937:{'nm':'最強戦士・超ベジット','main':1,'sub':5, 'hp':4310, 'atk':2005, 're':203, 'aw':{'skb': 2, 'hir': 1, 'yb': 2, '2way': 2}},
		1938:{'nm':'超サイヤ人3・ゴテンクス','main':2,'sub':1, 'hp':3105, 'atk':2052, 're':103, 'aw':{'skb': 3, 'hi': 1, '2way': 2, 'mz': 1}},
		1939:{'nm':'パーフェクトセル','main':3,'sub':5, 'hp':3726, 'atk':1604, 're':202, 'aw':{'ymr': 1, 're': 1, 'skb': 1, 'kir': 1, 'yb': 1, '2way': 2}},
		1969:{'nm':'神羅聖龍神サイガアナザー','main':3,'sub':4, 'hp':3300, 'atk':1618, 're':316, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'kir': 1, '2way': 2}},
		1973:{'nm':'光翼聖天キリコアナザー','main':1,'sub':4, 'hp':2288, 'atk':1543, 're':551, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, '2way': 1}},
		2006:{'nm':'天下御免の大泥棒・石川五右衛門','main':1,'sub':4, 'hp':4678, 'atk':1259, 're':217, 'aw':{'skb': 1, 'hir': 2, 'hi': 1}},
		2009:{'nm':'覚醒ホルス','main':1,'sub':5, 'hp':3375, 'atk':1424, 're':570, 'aw':{'huin': 2, 'skb': 2, 'yb': 1, 'hi': 2, '2way': 1}},
		2010:{'nm':'覚醒イシス','main':2,'sub':3, 'hp':3438, 'atk':1597, 're':433, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'mzr': 1, 'yb': 1, 'mz': 2}},
		2011:{'nm':'覚醒バステト','main':3,'sub':1, 'hp':3560, 'atk':1457, 're':485, 'aw':{'huin': 1, 'skb': 1, 'dk': 2, 'yb': 2, 'ki': 1, '2way': 1}},
		2012:{'nm':'覚醒ラー','main':4,'sub':1, 'hp':4355, 'atk':1300, 're':366, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'yb': 1, 'hk': 1, 'gls': 1}},
		2013:{'nm':'覚醒アヌビス','main':5,'sub':1, 'hp':3348, 'atk':1350, 're':618, 'aw':{'huin': 1, 'birs': 2, 're': 2, 'skb': 1, 'yb': 2}},
		2014:{'nm':'生徒会長・ルシファー','main':4,'sub':5, 'hp':2628, 'atk':2006, 're':504, 'aw':{'huin': 1, 're': 3, 'skb': 2, '2way': 3}},
		2020:{'nm':'紅焔の舞巫女・ミニちよめ','main':1,'sub':1, 'hp':2738, 'atk':1390, 're':383, 'aw':{'2way': 3}},
		2021:{'nm':'幻神・ミニおーでぃん','main':1,'sub':1, 'hp':3506, 'atk':1513, 're':58, 'aw':{'skb': 1, 'dk': 2, '2way': 3}},
		2073:{'nm':'覚醒レイラン','main':1,'sub':1, 'hp':4035, 'atk':1707, 're':202, 'aw':{'huin': 1, 'skb': 2, 'hir': 2, 'yb': 1, 'hi': 2}},
		2074:{'nm':'覚醒カリン','main':2,'sub':2, 'hp':3545, 'atk':1851, 're':284, 'aw':{'huin': 1, 'skb': 2, 'dk': 1, 'mzr': 2, 'yb': 1, 'mz': 1}},
		2075:{'nm':'覚醒メイメイ','main':3,'sub':3, 'hp':4175, 'atk':1804, 're':106, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'ki': 2, '2way': 2}},
		2076:{'nm':'覚醒ハク','main':5,'sub':2, 'hp':3193, 'atk':1441, 're':609, 'aw':{'huin': 1, 'skb': 1, 'ym': 2, 'yb': 1, '2way': 2, 'mz': 1}},
		2077:{'nm':'翠輝星の麒麟・サクヤ','main':4,'sub':3, 'hp':4028, 'atk':1470, 're':384, 'aw':{'huin': 1, 'skb': 1, 'dk': 1, 'yb': 1, 'hk': 2, 'gls': 1, 'jm': 1, '2way': 1}},
		2078:{'nm':'劫火の威女神・カーリー','main':5,'sub':1, 'hp':3325, 'atk':1774, 're':355, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'bire': 1, 'yb': 2, '2way': 1}},
		2084:{'nm':'きまぐれ召喚・でぶチョコボ','main':4,'sub':4, 'hp':5082, 'atk':726, 're':0, 'aw':{'skb': 1, 'dk': 2, 'hk': 2, 'hkdec': 2, 'ymdec': 2}},
		2094:{'nm':'フェニックスライダー・ヴァレン','main':1,'sub':2, 'hp':2290, 'atk':1508, 're':353, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, 'mlb': 1, '2way': 2}},
		2098:{'nm':'グリフォンライダー・ギリアム','main':3,'sub':5, 'hp':2213, 'atk':1659, 're':272, 'aw':{'huin': 1, 'skb': 1, 'kir': 1, 'mlb': 1, '2way': 2}},
		2102:{'nm':'ケルベロスライダー・ジゼ','main':5,'sub':3, 'hp':2250, 'atk':2001, 're':60, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'mlb': 1, '2way': 2}},
		2121:{'nm':'聖王アーサー','main':4,'sub':4, 'hp':2710, 'atk':1358, 're':378, 'aw':{'skb': 1, 'hkr': 2, '2way': 1}},
		2124:{'nm':'アテナの使命・沙織','main':4,'sub':4, 'hp':2808, 'atk':1344, 're':700, 'aw':{'huin': 2, 're': 3, 'skb': 2, 'hkr': 1}},
		2127:{'nm':'光の機神将・シェロスパーダ','main':4,'sub':3, 'hp':5135, 'atk':1086, 're':10, 'aw':{'birs': 2, 'skb': 1, 'hk': 1, 'hi': 1, 'ki': 1, 'mz': 1}},
		2128:{'nm':'闇の機神将・ハイスフェルゼン','main':5,'sub':1, 'hp':5045, 'atk':1119, 're':10, 'aw':{'birs': 2, 'skb': 1, 'ym': 1, 'hi': 1, 'ki': 1, 'mz': 1}},
		2129:{'nm':'無間の破戒神・大天狗','main':3,'sub':5, 'hp':4026, 'atk':1317, 're':0, 'aw':{'huin': 1, 'skb': 4, 'jm': 1}},
		2150:{'nm':'禍時の月龍喚士・サツキ','main':5,'sub':4, 'hp':4005, 'atk':1703, 're':46, 'aw':{'huin': 1, 'skb': 1, '2way': 3}},
		2179:{'nm':'滅槍の幻術神・オーディン','main':1,'sub':5, 'hp':4189, 'atk':2143, 're':154, 'aw':{'birs': 2, 'skb': 3, 'hir': 4}},
		2180:{'nm':'平定の黄泉神・イザナミ','main':5,'sub':1, 'hp':4711, 'atk':1551, 're':57, 'aw':{'re': 3, 'ym': 1, 'ymdec': 1}},
		2185:{'nm':'暴炎機導龍・トゥバン','main':1,'sub':1, 'hp':3096, 'atk':1491, 're':125, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'hir': 2}},
		2186:{'nm':'深海機導龍・サダルメリク','main':2,'sub':2, 'hp':3393, 'atk':1435, 're':73, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'mzr': 2}},
		2187:{'nm':'烈風機導龍・アルナイル','main':3,'sub':3, 'hp':3339, 'atk':1246, 're':205, 'aw':{'birs': 2, 'skb': 2, 'bire': 1, 'kir': 3}},
		2188:{'nm':'天雷機導龍・シェザル','main':4,'sub':4, 'hp':2804, 'atk':1652, 're':99, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'hkr': 2}},
		2189:{'nm':'刻滅機導龍・ディアデム','main':5,'sub':5, 'hp':2961, 'atk':1754, 're':0, 'aw':{'ymr': 3, 'birs': 2, 'skb': 2, 'bire': 1}},
		2190:{'nm':'灼翼機導獣・マルカブ','main':1,'sub':3, 'hp':3024, 'atk':1467, 're':254, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, '2way': 3}},
		2191:{'nm':'氷牙機導獣・アルフェッカ','main':2,'sub':5, 'hp':4046, 'atk':1309, 're':33, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, '2way': 2}},
		2192:{'nm':'風翼機導獣・ファクト','main':3,'sub':4, 'hp':3011, 'atk':1474, 're':257, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, '2way': 2}},
		2193:{'nm':'閃爪機導獣・レオニス','main':4,'sub':2, 'hp':2714, 'atk':1757, 're':168, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, '2way': 2}},
		2194:{'nm':'冥眼機導獣・カッカブ','main':5,'sub':1, 'hp':3213, 'atk':1663, 're':76, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, '2way': 2}},
		2206:{'nm':'闊達の灼冥魔・スカーレット','main':1,'sub':5, 'hp':3172, 'atk':1652, 're':422, 'aw':{'huin': 1, 'hidec': 1, 'skb': 2, 'hir': 2, 'yb': 1, 'hi': 1}},
		2226:{'nm':'制約と誓約・ゴン＝フリークス','main':3,'sub':1, 'hp':4005, 'atk':1708, 're':202, 'aw':{'skb': 3, 'kir': 2, 'ki': 1, '2way': 1}},
		2227:{'nm':'神速・キルア＝ゾルディック','main':5,'sub':4, 'hp':2695, 'atk':1873, 're':486, 'aw':{'ymr': 1, 'birs': 2, 'skb': 1, 'ym': 1, 'dk': 1, '2way': 1}},
		2230:{'nm':'気狂いピエロ・カイト','main':5,'sub':4, 'hp':3223, 'atk':1418, 're':347, 'aw':{'huin': 2, 'skb': 1, 'ym': 1, 'yb': 1, 'hk': 1, 'hi': 1, 'ki': 1, 'mz': 1}},
		2235:{'nm':'復仇の戦軍神・アレス','main':1,'sub':4, 'hp':3712, 'atk':1694, 're':80, 'aw':{'huin': 1, 'skb': 1, 'hir': 3, 'gls': 1, '2way': 1}},
		2236:{'nm':'還魂の商業神・ヘルメス','main':2,'sub':5, 'hp':2974, 'atk':1898, 're':164, 'aw':{'huin': 1, 'skb': 2, 'mzr': 3, '2way': 1}},
		2237:{'nm':'月華の狩猟神・アルテミス','main':3,'sub':5, 'hp':3040, 'atk':1705, 're':271, 'aw':{'huin': 1, 'skb': 1, 'kir': 3, 'gls': 1, '2way': 1}},
		2238:{'nm':'渾天の光明神・アポロン','main':4,'sub':2, 'hp':2558, 'atk':1823, 're':466, 'aw':{'skb': 1, 'hkr': 2, 'ht': 2, '2way': 2}},
		2239:{'nm':'揺籃の冥府神・ペルセポネ','main':5,'sub':3, 'hp':2939, 'atk':1337, 're':640, 'aw':{'ymr': 2, 'skb': 1, 'ht': 2, '2way': 2}},
		2249:{'nm':'純血の魔王アスモ・デウス・アナザー','main':5,'sub':3, 'hp':2593, 'atk':1401, 're':667, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2253:{'nm':'破壊神・シヴァ＝ドラゴン','main':1,'sub':5, 'hp':4018, 'atk':1705, 're':218, 'aw':{'huin': 1, 'skb': 2, 'hir': 2, 'yb': 1, '2way': 2}},
		2255:{'nm':'海王神・ネプチューン＝ドラゴン','main':2,'sub':5, 'hp':4528, 'atk':1453, 're':231, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'mzr': 4, 'yb': 1}},
		2257:{'nm':'光槍神・オーディン＝ドラゴン','main':3,'sub':4, 'hp':4000, 'atk':1100, 're':900, 'aw':{'birs': 2, 're': 6, 'skb': 1}},
		2259:{'nm':'太陽神・ラー＝ドラゴン','main':4,'sub':4, 'hp':4705, 'atk':1508, 're':155, 'aw':{'birs': 2, 'skb': 2, 'yb': 2, '2way': 2}},
		2261:{'nm':'夜刻神・ツクヨミ＝ドラゴン','main':5,'sub':4, 'hp':3801, 'atk':1804, 're':245, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'bire': 1, 'ym': 1, 'yb': 2}},
		2278:{'nm':'笑覧の芸女神・アメノウズメ','main':1,'sub':2, 'hp':3145, 'atk':1325, 're':501, 'aw':{'birs': 2, 're': 2, 'skb': 1, 'hir': 1, 'hi': 1}},
		2279:{'nm':'賦活の漁猟神・ウミサチヤマサチ','main':2,'sub':3, 'hp':3555, 'atk':1251, 're':651, 'aw':{'huin': 1, 'skb': 1, 'gls': 1, 'ki': 2, '2way': 2, 'mz': 2}},
		2280:{'nm':'庇護の巫女神・クシナダヒメ','main':3,'sub':3, 'hp':2805, 'atk':1732, 're':640, 'aw':{'huin': 1, 're': 1, 'skb': 1, 'bire': 1, 'kir': 1, 'yb': 1, 'ht': 1, 'ki': 2}},
		2281:{'nm':'双天の皇祖神・イザナギ','main':4,'sub':5, 'hp':3645, 'atk':1616, 're':415, 'aw':{'huin': 2, 'skb': 2, 'ht': 1, 'hk': 1, '2way': 2}},
		2282:{'nm':'鎮撫の国造神・オオクニヌシ','main':5,'sub':2, 'hp':3845, 'atk':1819, 're':74, 'aw':{'huin': 1, 'skb': 2, 'ym': 1, 'yb': 1, '2way': 2}},
		2286:{'nm':'お忍びの王女・アルビダ','main':2,'sub':2, 'hp':3083, 'atk':1848, 're':59, 'aw':{'mzdec': 4, 'mz': 5}},
		2287:{'nm':'楽園の緑龍喚士・ソニア','main':3,'sub':2, 'hp':3038, 'atk':1919, 're':274, 'aw':{'skb': 2, 'bire': 1, 'kir': 2, 'yb': 1, '2way': 2}},
		2289:{'nm':'楽園の時女神・ウルド','main':2,'sub':1, 'hp':3715, 'atk':1688, 're':122, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 1, '2way': 1, 'mz': 3}},
		2290:{'nm':'雪白の美姫・ヴァルキリークレール','main':5,'sub':2, 'hp':2558, 'atk':1689, 're':656, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 1, '2way': 2}},
		2292:{'nm':'冥夜の令嬢・パンドラ','main':5,'sub':2, 'hp':3048, 'atk':1484, 're':509, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 2, 'yb': 1, '2way': 2}},
		2294:{'nm':'破壊の赤機操士・ピュール＝マキナ','main':1,'sub':3, 'hp':2885, 'atk':1386, 're':358, 'aw':{'hir': 1, 'yb': 2, 'hi': 1, 'ki': 1}},
		2296:{'nm':'再生の青機操士・シャリテ＝マキナ','main':2,'sub':1, 'hp':2908, 'atk':1330, 're':385, 'aw':{'mzr': 1, 'yb': 2, 'hi': 1, 'mz': 1}},
		2298:{'nm':'創造の緑機操士・クラジュ＝マキナ','main':3,'sub':2, 'hp':2928, 'atk':1364, 're':358, 'aw':{'kir': 1, 'yb': 2, 'ki': 1, 'mz': 1}},
		2317:{'nm':'絶世の紅龍喚士・ミニそにあ','main':1,'sub':5, 'hp':3097, 'atk':1975, 're':165, 'aw':{'ymr': 2, 'skb': 1, 'hir': 2, 'yb': 1}},
		2318:{'nm':'琥珀の美姫・ヴァルキリークレール','main':5,'sub':2, 'hp':2558, 'atk':1689, 're':656, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 1, '2way': 2}},
		2321:{'nm':'神命姫神・ミニばるきりーろーず','main':4,'sub':3, 'hp':2308, 'atk':1489, 're':656, 'aw':{'huin': 1, 'skb': 1, '2way': 3}},
		2322:{'nm':'覚醒ヤマタノオロチ','main':2,'sub':3, 'hp':5090, 'atk':1000, 're':282, 'aw':{'skb': 2, 'mzr': 1, 'yb': 1, '2way': 4}},
		2323:{'nm':'覚醒スサノオノミコト','main':3,'sub':1, 'hp':4370, 'atk':1386, 're':298, 'aw':{'birs': 2, 'skb': 2, 'yb': 1, 'ki': 1, '2way': 2}},
		2324:{'nm':'覚醒アマテラスオオカミ','main':4,'sub':3, 'hp':3821, 'atk':1011, 're':682, 'aw':{'huin': 2, 'birs': 2, 'skb': 2, 'bire': 1, '2way': 1}},
		2325:{'nm':'覚醒ツクヨミ','main':5,'sub':3, 'hp':4372, 'atk':1536, 're':205, 'aw':{'huin': 1, 'skb': 1, 'ym': 3, 'yb': 3}},
		2328:{'nm':'ミサト&AAAヴンダー・主砲斉射','main':1,'sub':4, 'hp':2895, 'atk':1780, 're':282, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'hir': 1, '2way': 2}},
		2340:{'nm':'ナルガクルガ&ナルガネコ','main':5,'sub':1, 'hp':2543, 'atk':1936, 're':193, 'aw':{'huin': 2, 'skb': 1, '2way': 1}},
		2342:{'nm':'ジンオウガ&オウガネコ','main':4,'sub':2, 'hp':4005, 'atk':1454, 're':41, 'aw':{'huin': 2, 'skb': 1, '2way': 1}},
		2343:{'nm':'怒るティガレックス&レックスネコ','main':3,'sub':1, 'hp':4140, 'atk':1565, 're':115, 'aw':{'huin': 1, 'skb': 2, 'hir': 2, 'kir': 2, '2way': 2}},
		2344:{'nm':'狂竜化ゴア・マガラ&ゴアネコ','main':5,'sub':5, 'hp':3145, 'atk':1912, 're':209, 'aw':{'huin': 1, 'ymr': 2, 'skb': 2, 'ym': 1, 'gls': 1, '2way': 2}},
		2355:{'nm':'反攻の巨人・エレン・イェーガー','main':1,'sub':4, 'hp':4508, 'atk':1801, 're':162, 'aw':{'birs': 2, 'skb': 1, 'hir': 2}},
		2357:{'nm':'冷静な猛獣・ミカサ・アッカーマン','main':2,'sub':1, 'hp':3213, 'atk':1805, 're':103, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2360:{'nm':'人類最強の兵士・リヴァイ','main':5,'sub':5, 'hp':3025, 'atk':2001, 're':151, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 2}},
		2384:{'nm':'統嵐焦炎神・セト','main':1,'sub':3, 'hp':3450, 'atk':1689, 're':126, 'aw':{'skb': 1, 'ht': 1, 'hi': 2, 'ki': 1, '2way': 3}},
		2385:{'nm':'占命星雲神・ヌト','main':2,'sub':2, 'hp':3660, 'atk':1332, 're':288, 'aw':{'yb': 1, 'ht': 1, '2way': 2, 'mz': 4}},
		2386:{'nm':'裁魂冥穣神・オシリス','main':3,'sub':3, 'hp':3090, 'atk':1467, 're':368, 'aw':{'yb': 1, 'ht': 1, 'ki': 4, '2way': 2}},
		2387:{'nm':'彩天聖命神・ハトホル','main':4,'sub':2, 'hp':2760, 'atk':1281, 're':568, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'hk': 4, 'mz': 1}},
		2388:{'nm':'翔夜冥霊神・ネフティス','main':5,'sub':1, 'hp':2653, 'atk':1405, 're':538, 'aw':{'huin': 1, 'skb': 1, 'ym': 4, 'ht': 1, 'hi': 1}},
		2389:{'nm':'覚醒サクヤ','main':4,'sub':2, 'hp':3378, 'atk':1570, 're':504, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, 'gls': 1, 'jm': 1, '2way': 1}},
		2390:{'nm':'想紡の時女神・ヴェルダンディ','main':3,'sub':1, 'hp':3255, 'atk':1467, 're':502, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'ht': 1, 'ki': 3, '2way': 1}},
		2391:{'nm':'白虹の聖舟神・ノア','main':2,'sub':4, 'hp':6003, 'atk':1113, 're':0, 'aw':{'huin': 1, 'birs': 1, 're': 1, 'skb': 1, 'mzr': 1}},
		2392:{'nm':'覚醒フレイ','main':1,'sub':2, 'hp':4225, 'atk':1712, 're':137, 'aw':{'huin': 2, 'skb': 1, 'hir': 2, 'ht': 1, '2way': 2}},
		2393:{'nm':'覚醒イズン&イズーナ','main':2,'sub':5, 'hp':3915, 'atk':1732, 're':219, 'aw':{'huin': 2, 'skb': 1, 'mzr': 2, 'ht': 1, '2way': 2}},
		2394:{'nm':'覚醒フレイヤ','main':3,'sub':5, 'hp':3635, 'atk':1815, 're':260, 'aw':{'huin': 2, 'skb': 1, 'kir': 3, 'ht': 1, '2way': 1}},
		2395:{'nm':'覚醒トール','main':4,'sub':2, 'hp':3213, 'atk':2150, 're':184, 'aw':{'huin': 2, 'skb': 2, 'hkr': 3, 'ht': 1}},
		2396:{'nm':'覚醒ロキ','main':5,'sub':4, 'hp':3868, 'atk':1662, 're':277, 'aw':{'huin': 2, 'ymr': 2, 'skb': 1, 'ht': 1, '2way': 2}},
		2398:{'nm':'覚醒スルト','main':1,'sub':5, 'hp':3815, 'atk':1555, 're':0, 'aw':{'skb': 1, 'hir': 1, '2way': 1}},
		2406:{'nm':'古城の青龍喚士・ソニア','main':5,'sub':2, 'hp':5180, 'atk':1409, 're':0, 'aw':{'ymr': 1, 'skb': 2, 'bire': 1, 'ym': 1, 'mzr': 1}},
		2407:{'nm':'古城の女主神・カーリー','main':5,'sub':4, 'hp':3015, 'atk':1411, 're':633, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 2}},
		2408:{'nm':'仮装祭の来賓・イザナミ','main':5,'sub':2, 'hp':3287, 'atk':1239, 're':409, 'aw':{'skb': 1, 'ym': 5, 'hkdec': 3}},
		2409:{'nm':'好奇の客人・ライラ','main':5,'sub':5, 'hp':2325, 'atk':1606, 're':511, 'aw':{'huin': 1, 'ymr': 3, 'skb': 1, '2way': 1}},
		2410:{'nm':'月夜の魔狼・ヴァンパイアロード','main':5,'sub':1, 'hp':2996, 'atk':1368, 're':463, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'skb': 1, '2way': 2}},
		2441:{'nm':'裁爪の橙龍契士・サリア','main':4,'sub':1, 'hp':4118, 'atk':1518, 're':120, 'aw':{'skb': 1, 'hkr': 2, 'yb': 1, '2way': 1}},
		2443:{'nm':'還爪の青龍契士・リューネ','main':2,'sub':5, 'hp':3418, 'atk':1903, 're':205, 'aw':{'skb': 1, 'mzr': 2, 'yb': 1, '2way': 2}},
		2444:{'nm':'北斗神拳伝承者・ケンシロウ','main':1,'sub':4, 'hp':4205, 'atk':1820, 're':76, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 2}},
		2445:{'nm':'最大の強敵・ラオウ','main':1,'sub':5, 'hp':3638, 'atk':2125, 're':63, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'hir': 2, 'yb': 1}},
		2447:{'nm':'南斗最後の将・ユリア','main':4,'sub':4, 'hp':2685, 'atk':1255, 're':704, 'aw':{'huin': 1, 'skb': 1, 'hkr': 1, 'yb': 1, 'ht': 1}},
		2459:{'nm':'鉄砕牙の奥義・犬夜叉','main':1,'sub':4, 'hp':4803, 'atk':1760, 're':108, 'aw':{'huin': 2, 'skb': 1, 'yb': 2, '2way': 1}},
		2463:{'nm':'鬼族の宇宙人・ラム','main':4,'sub':3, 'hp':3215, 'atk':1802, 're':56, 'aw':{'huin': 1, 'skb': 1, 'ht': 2, 'hk': 3}},
		2465:{'nm':'うしおととら','main':4,'sub':1, 'hp':4553, 'atk':1508, 're':20, 'aw':{'huin': 1, 'kilr': 1, 'birs': 2, 'yb': 1}},
		2473:{'nm':'創世の魔法使い・アラジン','main':4,'sub':4, 'hp':2918, 'atk':1346, 're':425, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 2, 'hk': 2}},
		2475:{'nm':'王の器・アリババ','main':1,'sub':4, 'hp':2645, 'atk':1827, 're':216, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'hk': 2, 'hi': 2}},
		2486:{'nm':'とら','main':4,'sub':5, 'hp':3603, 'atk':1459, 're':0, 'aw':{'skb': 3, 'yb': 1, 'hk': 5}},
		2493:{'nm':'愛護の星天使・ロズエル','main':1,'sub':2, 'hp':3720, 'atk':1613, 're':90, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, '2way': 3}},
		2494:{'nm':'巡警の星天使・ファミエル','main':2,'sub':4, 'hp':2458, 'atk':1411, 're':600, 'aw':{'birs': 2, 'skb': 1, '2way': 3, 'mz': 1}},
		2495:{'nm':'魔壊の星天使・リュエル','main':3,'sub':5, 'hp':2598, 'atk':1659, 're':398, 'aw':{'birs': 2, 'skb': 1, 'ht': 1, '2way': 3}},
		2496:{'nm':'煌斧の星天使・アリエル','main':4,'sub':1, 'hp':2805, 'atk':1703, 're':308, 'aw':{'birs': 2, 'skb': 1, 'ht': 1, '2way': 3}},
		2497:{'nm':'冥鈴の星天使・ルミエル','main':5,'sub':2, 'hp':3468, 'atk':1582, 're':187, 'aw':{'birs': 2, 'skb': 1, 'ym': 1, '2way': 3}},
		2498:{'nm':'灼龍の熾天使・ウリエル','main':1,'sub':1, 'hp':2545, 'atk':1892, 're':606, 'aw':{'huin': 1, 're': 4, 'skb': 1, 'hir': 3}},
		2499:{'nm':'神成の大天使・ガブリエル','main':2,'sub':2, 'hp':2538, 'atk':1719, 're':723, 'aw':{'huin': 1, 're': 4, 'skb': 1, 'mzr': 3}},
		2500:{'nm':'滅尽の大天使・ミカエル','main':3,'sub':3, 'hp':2420, 'atk':1969, 're':611, 'aw':{'huin': 1, 're': 4, 'skb': 1, 'kir': 3}},
		2501:{'nm':'創智の大天使・ラファエル','main':4,'sub':1, 'hp':3720, 'atk':1278, 're':635, 'aw':{'huin': 1, 'skb': 2, 'bire': 1, 'hkr': 5}},
		2502:{'nm':'背徳の熾天使・ルシファー','main':5,'sub':2, 'hp':3228, 'atk':1656, 're':554, 'aw':{'huin': 1, 're': 4, 'skb': 1, '2way': 3}},
		2503:{'nm':'爆轟の魔神卿・ベリアル','main':1,'sub':1, 'hp':4040, 'atk':1606, 're':327, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'hir': 3, 'yb': 1}},
		2504:{'nm':'我道の魔神卿・アモン','main':2,'sub':4, 'hp':3895, 'atk':1363, 're':513, 'aw':{'huin': 1, 'kilr': 1, 'birs': 2, 'skb': 2, 'mzr': 3}},
		2505:{'nm':'覚醒アスタロト','main':3,'sub':4, 'hp':2800, 'atk':1680, 're':604, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'kir': 3}},
		2506:{'nm':'王眼の魔神卿・バアル','main':4,'sub':5, 'hp':2893, 'atk':1826, 're':530, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'hkr': 3, 'mlb': 1}},
		2507:{'nm':'覚醒神魔王ルシファー','main':5,'sub':4, 'hp':3028, 'atk':1606, 're':584, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 3, 'skb': 3}},
		2509:{'nm':'伐爪の緑龍契士・シルヴィ','main':3,'sub':4, 'hp':3010, 'atk':2063, 're':233, 'aw':{'skb': 1, 'kir': 2, 'yb': 1, '2way': 2}},
		2510:{'nm':'星鐘の麒麟姫・サクヤ','main':4,'sub':1, 'hp':3128, 'atk':1470, 're':654, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'hk': 1, 'hi': 1, 'gls': 1, 'jm': 1, '2way': 2}},
		2511:{'nm':'聖堂の女主神・カーリー','main':1,'sub':5, 'hp':3325, 'atk':1774, 're':355, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'bire': 1, 'yb': 2, '2way': 1}},
		2512:{'nm':'聖夜の赤龍喚士・ソニア','main':1,'sub':3, 'hp':3397, 'atk':2175, 're':165, 'aw':{'skb': 2, 'bire': 1, 'hir': 2, 'kir': 1, 'yb': 1}},
		2514:{'nm':'熱宴の龍英傑・劉備','main':1,'sub':3, 'hp':2625, 'atk':1705, 're':353, 'aw':{'skb': 1, 'hir': 1, 'hi': 1, 'jm': 1, '2way': 3}},
		2515:{'nm':'聖祭の女傑・エキドナ','main':1,'sub':3, 'hp':1277, 'atk':1349, 're':650, 'aw':{'skb': 1, 'hir': 1, 'ht': 2}},
		2516:{'nm':'聖堂の歌姫・セイレーン','main':2,'sub':1, 'hp':1611, 'atk':1135, 're':691, 'aw':{'skb': 1, 'mzr': 1, 'ht': 2}},
		2517:{'nm':'聖樹の精霊・アルラウネ','main':3,'sub':1, 'hp':2224, 'atk':1099, 're':518, 'aw':{'skb': 1, 'kir': 1, 'ht': 2}},
		2518:{'nm':'聖天の使徒・エンジェル','main':4,'sub':1, 'hp':1530, 'atk':1110, 're':730, 'aw':{'skb': 1, 'hkr': 1, 'ht': 2}},
		2519:{'nm':'聖夜の魔女・リリス','main':5,'sub':1, 'hp':1427, 'atk':1358, 're':608, 'aw':{'ymr': 1, 'skb': 1, 'ht': 2}},
		2520:{'nm':'遊覧の魔導姫・アルス＝パウリナ','main':2,'sub':1, 'hp':3638, 'atk':1217, 're':0, 'aw':{'skb': 2, 'hi': 2, 'mz': 5}},
		2526:{'nm':'覚醒マシンヘラ','main':5,'sub':0, 'hp':5000, 'atk':2000, 're':300, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'birs': 2, 'skb': 2, '2way': 1}},
		2528:{'nm':'覚醒マシンゼウス','main':4,'sub':0, 'hp':4000, 'atk':2350, 're':400, 'aw':{'huin': 1, 'kilr': 1, 'birs': 2, 'skb': 2, 'hkr': 2, '2way': 1}},
		2533:{'nm':'遊山の天舞神・アマテラスオオカミ','main':4,'sub':2, 'hp':3821, 'atk':1011, 're':682, 'aw':{'huin': 2, 'kilr': 1, 'birs': 2, 'skb': 1, 'bire': 1}},
		2534:{'nm':'紅日の寿龍喚士・カンナ','main':4,'sub':1, 'hp':3378, 'atk':1610, 're':353, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, '2way': 3}},
		2535:{'nm':'初日の朱雀姫・レイラン','main':1,'sub':4, 'hp':3335, 'atk':1577, 're':302, 'aw':{'skb': 1, 'yb': 1, 'hk': 1, 'hi': 5, 'ki': 1}},
		2536:{'nm':'宿願の武皇神・ヤマトタケル','main':1,'sub':4, 'hp':3473, 'atk':1251, 're':428, 'aw':{'huin': 1, 'kilr': 1, 'skb': 3, 'bire': 1, 'hir': 1, 'yb': 1, 'mlb': 1}},
		2538:{'nm':'初日影の幻光・服部半蔵','main':4,'sub':5, 'hp':2089, 'atk':1898, 're':480, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'hkr': 1, '2way': 1}},
		2539:{'nm':'鎮守の翠月花・かぐや姫','main':4,'sub':3, 'hp':2195, 'atk':1409, 're':623, 'aw':{'skb': 1, 'yb': 1, 'ymdec': 4, '2way': 1}},
		2540:{'nm':'伝統のだるま・大天狗','main':3,'sub':4, 'hp':4126, 'atk':1317, 're':0, 'aw':{'huin': 1, 'skb': 4, 'jm': 1}},
		2563:{'nm':'滅弓の鋼星神・アウストラリス','main':3,'sub':2, 'hp':3110, 'atk':1555, 're':475, 'aw':{'kir': 5}},
		2565:{'nm':'衛瓶の鋼星神・シェアト','main':2,'sub':1, 'hp':5055, 'atk':653, 're':460, 'aw':{'skb': 1, '2way': 5}},
		2566:{'nm':'隔世の蒼龍喚士・ソニア','main':2,'sub':5, 'hp':5780, 'atk':1609, 're':0, 'aw':{'huin': 1, 'ymr': 1, 'skb': 2, 'bire': 1, 'mzr': 2, 'yb': 1, 'mz': 1}},
		2567:{'nm':'宿世の翠龍喚士・ソニア','main':3,'sub':5, 'hp':3938, 'atk':1820, 're':425, 'aw':{'huin': 1, 'ymr': 1, 'skb': 2, 'bire': 1, 'kir': 2, 'yb': 1, 'ki': 1}},
		2568:{'nm':'聖都の守護神・アテナアナザー','main':4,'sub':3, 'hp':3018, 'atk':2251, 're':0, 'aw':{'huin': 1, 'skb': 1, 'kir': 1, 'mlb': 1, 'gls': 2, '2way': 2}},
		2569:{'nm':'翠輝星の麒麟・サクヤアナザー','main':4,'sub':3, 'hp':4028, 'atk':1470, 're':384, 'aw':{'huin': 1, 'skb': 1, 'dk': 1, 'yb': 1, 'hk': 1, 'mlb': 1, 'gls': 1, 'jm': 1, '2way': 1}},
		2570:{'nm':'絶世の紅龍喚士・ソニアアナザー','main':1,'sub':5, 'hp':3297, 'atk':1925, 're':165, 'aw':{'huin': 1, 'ymr': 1, 'skb': 2, 'bire': 1, 'hir': 1, 'yb': 1, 'mlb': 1}},
		2592:{'nm':'裁秤の鋼星神・エスカマリ','main':5,'sub':4, 'hp':3805, 'atk':1555, 're':293, 'aw':{'huin': 1, 'skb': 1, 'ym': 7}},
		2594:{'nm':'抗神機・ラグナロク＝ドラゴン','main':3,'sub':5, 'hp':5030, 'atk':1605, 're':0, 'aw':{'huin': 1, 'kilr': 2, 'birs': 2, 'skb': 1, 'yb': 2, '2way': 1}},
		2595:{'nm':'ボルメテウス・蒼炎・ドラゴン','main':1,'sub':2, 'hp':3863, 'atk':1863, 're':108, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'yb': 1, '2way': 2}},
		2606:{'nm':'黒焚連合初代総長・古川修','main':3,'sub':1, 'hp':3803, 'atk':1408, 're':103, 'aw':{'kilr': 1, 'skb': 3}},
		2639:{'nm':'神脅の毒蛇・ヨルムンガンド','main':3,'sub':2, 'hp':4195, 'atk':1508, 're':103, 'aw':{'skb': 2, 'dk': 1, 'yb': 2, '2way': 1}},
		2641:{'nm':'神仇の魔狼・フェンリル','main':5,'sub':1, 'hp':3005, 'atk':2010, 're':213, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2657:{'nm':'義烈の武皇神・ヤマトタケル','main':1,'sub':1, 'hp':3573, 'atk':1701, 're':428, 'aw':{'huin': 1, 'skb': 3, 'bire': 1, 'hir': 3, 'yb': 1}},
		2658:{'nm':'敬愛の星海神・アンドロメダ','main':2,'sub':2, 'hp':3985, 'atk':1238, 're':578, 'aw':{'huin': 2, 'skb': 1, 'bire': 1, 'mzr': 3, 'yb': 1, '2way': 1}},
		2659:{'nm':'勇武の破邪神・ペルセウス','main':3,'sub':3, 'hp':3745, 'atk':1644, 're':409, 'aw':{'huin': 2, 'skb': 2, 'bire': 1, 'kir': 2, 'yb': 2}},
		2660:{'nm':'功徳の金猿神・孫悟空','main':4,'sub':4, 'hp':3728, 'atk':1374, 're':576, 'aw':{'huin': 1, 'skb': 3, 'bire': 1, 'hkr': 2, 'yb': 1, '2way': 1}},
		2661:{'nm':'冷刻の冥夜神・パンドラ','main':5,'sub':5, 'hp':3248, 'atk':1474, 're':659, 'aw':{'huin': 1, 'ymr': 2, 'skb': 2, 'bire': 1, 'yb': 2, '2way': 1}},
		2662:{'nm':'覚醒パンドラ','main':5,'sub':1, 'hp':4148, 'atk':1474, 're':279, 'aw':{'huin': 1, 'ymr': 3, 'skb': 2, 'bire': 1, 'yb': 1}},
		2663:{'nm':'追憶の時女神・ウルド','main':1,'sub':2, 'hp':2715, 'atk':1888, 're':421, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'ht': 1, 'hi': 3, '2way': 1}},
		2677:{'nm':'虚化・黒崎一護','main':5,'sub':5, 'hp':3230, 'atk':1715, 're':438, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2679:{'nm':'十三番隊隊士・朽木ルキア','main':2,'sub':4, 'hp':3165, 'atk':1563, 're':475, 'aw':{'huin': 2, 'skb': 1, 'yb': 1}},
		2685:{'nm':'魔人の一撃・茶渡泰虎','main':1,'sub':3, 'hp':3165, 'atk':1648, 're':13, 'aw':{'hir': 1, 'hi': 1, 'gls': 1}},
		2691:{'nm':'十番隊隊長・日番谷冬獅郎','main':2,'sub':2, 'hp':2835, 'atk':1678, 're':233, 'aw':{'skb': 2, 'dk': 2, 'mzr': 1, 'yb':1}},
		2711:{'nm':'救翼の龍騎神・シェリアス','main':2,'sub':4, 'hp':3628, 'atk':1533, 're':230, 'aw':{'huin': 1, 'kilr': 2, 'skb': 1, 'yb': 1}},
		2713:{'nm':'灼刃の龍機神・バルディン','main':1,'sub':5, 'hp':3028, 'atk':2003, 're':248, 'aw':{'huin': 2, 'kilr': 2, 'skb': 2}},
		2714:{'nm':'予知の時女神・スクルド','main':2,'sub':3, 'hp':5075, 'atk':1411, 're':301, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 1, 'ki': 1, '2way': 2, 'mz': 2}},
		2716:{'nm':'鍛錬神・ヘパイストス＝ドラゴン','main':1,'sub':0, 'hp':4400, 'atk':2200, 're':200, 'aw':{'skb': 1, 'hir': 1, '2way': 2}},
		2717:{'nm':'聖舶神・ノア＝ドラゴン','main':2,'sub':0, 'hp':6000, 'atk':1500, 're':150, 'aw':{'skb': 1, 'mzr': 2, 'yb': 1}},
		2718:{'nm':'起源神・ガイア=ドラゴン','main':3,'sub':0, 'hp':5500, 'atk':1700, 're':180, 'aw':{'skb': 1, 'yb': 1, '2way': 2}},
		2719:{'nm':'全能神・ゼウス＝ドラゴン','main':4,'sub':0, 'hp':5000, 'atk':2000, 're':300, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2720:{'nm':'暗黒神・ヘラ＝ドラゴン','main':5,'sub':0, 'hp':4800, 'atk':2100, 're':300, 'aw':{'skb': 1, 'ym': 2, 'yb': 1}},
		2722:{'nm':'覚醒ヘパイストス','main':1,'sub':1, 'hp':3565, 'atk':1655, 're':173, 'aw':{'skb': 1, 'hi': 1, '2way': 1}},
		2735:{'nm':'GCナビゲーター・リンカ','main':4,'sub':4, 'hp':3035, 'atk':1378, 're':320, 'aw':{'yb': 1, 'hk': 6}},
		2739:{'nm':'転生バーンフェニックスナイト・ホムラ','main':1,'sub':1, 'hp':3134, 'atk':1373, 're':419, 'aw':{'hi': 3, '2way': 2}},
		2740:{'nm':'転生フラッドフェンリルナイト・カムイ','main':2,'sub':2, 'hp':3137, 'atk':1453, 're':356, 'aw':{'2way': 2, 'mz': 3}},
		2741:{'nm':'転生エンシェントドラゴンナイト・セロ','main':3,'sub':3, 'hp':3238, 'atk':1412, 're':366, 'aw':{'ki': 3, '2way': 2}},
		2742:{'nm':'転生スカイゴッドナイト・ヴァーチェ','main':4,'sub':4, 'hp':3079, 'atk':1397, 're':408, 'aw':{'hk': 3, '2way': 2}},
		2743:{'nm':'転生カオスドラゴンナイト・ヴォイス','main':5,'sub':5, 'hp':3197, 'atk':1436, 're':345, 'aw':{'ym': 3, '2way': 2}},
		2744:{'nm':'忘我の赤龍契士・ガディウス','main':1,'sub':4, 'hp':3063, 'atk':1204, 're':753, 'aw':{'kilr': 1, 'birs': 2, 'bire': 1, 'hir': 2, 'yb': 1, 'hi': 1}},
		2745:{'nm':'滅法の黒龍契士・ティフォン','main':5,'sub':2, 'hp':4013, 'atk':1646, 're':386, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, '2way': 1}},
		2746:{'nm':'隻眼の獄幻魔・ズオー','main':5,'sub':3, 'hp':4695, 'atk':1621, 're':0, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 1, 'kir': 1, 'yb': 1, '2way': 1}},
		2747:{'nm':'覚醒アレス','main':1,'sub':3, 'hp':3012, 'atk':2244, 're':200, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, 'hi': 2, 'gls': 1, '2way': 2}},
		2748:{'nm':'覚醒ヘルメス','main':2,'sub':1, 'hp':2274, 'atk':1998, 're':564, 'aw':{'huin': 1, 'skb': 2, 'mzr': 2, '2way': 1, 'mz': 2}},
		2749:{'nm':'覚醒アルテミス','main':3,'sub':2, 'hp':2540, 'atk':1965, 're':501, 'aw':{'huin': 1, 'skb': 1, 'kir': 1, 'gls': 1, 'ki': 2, '2way': 2}},
		2750:{'nm':'覚醒アポロン','main':4,'sub':3, 'hp':2758, 'atk':1853, 're':516, 'aw':{'huin': 1, 'skb': 1, 'ht': 2, 'hk': 2, '2way': 2}},
		2751:{'nm':'覚醒ペルセポネ','main':5,'sub':2, 'hp':2639, 'atk':1707, 're':630, 'aw':{'huin': 1, 'skb': 1, 'ym': 2, 'ht': 2, '2way': 2}},
		2752:{'nm':'天空の守護龍・アヴァロンドレイク','main':3,'sub':4, 'hp':4075, 'atk':1509, 're':250, 'aw':{'huin': 1, 'skb': 3, 'kir': 3}},
		2756:{'nm':'紅蘭の君子・シャンメイ','main':1,'sub':0, 'hp':2812, 'atk':1903, 're':1001, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'hir': 1, 'yb': 1}},
		2758:{'nm':'蒼竹の君子・ヨウユウ','main':2,'sub':0, 'hp':3655, 'atk':2606, 're':325, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'yb': 1, 'mz': 3}},
		2760:{'nm':'黄菊の君子・シュウミン','main':4,'sub':0, 'hp':7011, 'atk':1465, 're':0, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hkr': 2, 'yb': 1}},
		2762:{'nm':'紫梅の君子・シンファ','main':5,'sub':0, 'hp':4496, 'atk':1714, 're':599, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'skb': 1, 'yb': 1, '2way': 1}},
		2764:{'nm':'クラウド＆フェンリル','main':4,'sub':4, 'hp':2873, 'atk':2009, 're':488, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hkr': 2, '2way': 2}},
		2765:{'nm':'片翼の天使・セフィロス','main':5,'sub':5, 'hp':3735, 'atk':2302, 're':63, 'aw':{'kilr': 3, 'skb': 1, 'yb': 1, '2way': 2}},
		2766:{'nm':'覚悟の召喚士・ユウナ','main':4,'sub':2, 'hp':2838, 'atk':1778, 're':646, 'aw':{'huin': 2, 'skb': 1, 'yb': 4}},
		2768:{'nm':'暗黒騎士・セシル','main':5,'sub':5, 'hp':2798, 'atk':2153, 're':428, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, '2way': 2, 'ymdec':3}},
		2769:{'nm':'パラディン・セシル','main':4,'sub':5, 'hp':5102, 'atk':1596, 're':78, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, '2way': 2, 're':3}},
		2771:{'nm':'探求の風・バッツ','main':3,'sub':4, 'hp':3495, 'atk':1455, 're':328, 'aw':{'2way':3, 'yb':1, 'huin':2, 'hkdec':3}},
		2775:{'nm':'最凶の黒魔道士・シャントット','main':5,'sub':3, 'hp':2635, 'atk':2103, 're':50, 'aw':{'ymr': 6, 'kir':3}},
		2777:{'nm':'かけだしの空賊・ヴァン','main':4,'sub':1, 'hp':4095, 'atk':1670, 're':28, 'aw':{'hkr': 4, '2way': 2, 'hir':2, 'skb':1}},
		2780:{'nm':'解放者・ライトニング','main':4,'sub':4, 'hp':3475, 'atk':1790, 're':598, 'aw':{'kilr': 1, 'skb': 3, 'yb': 1, 'huin':1, 'hkr':3}},
		2800:{'nm':'究極装備・バーサーカー','main':1,'sub':1, 'hp':3538, 'atk':1508, 're':4, 'aw':{'kilr': 1, 'skb': 3, 'hir': 1, '2way': 1}},
		2807:{'nm':'彩王妃・ヘラ・ベオーク','main':3,'sub':5, 'hp':3456, 'atk':1815, 're':274, 'aw':{'skb': 1, 'kir': 2, 'ki': 2, 'hkdec': 1}},
		2808:{'nm':'翠光の月天花・かぐや姫','main':3,'sub':4, 'hp':2795, 'atk':1409, 're':653, 'aw':{'skb': 2, 'kir': 1, 'yb': 1, '2way': 1}},
		2810:{'nm':'誠意の学級委員長・アテナ','main':3,'sub':4, 'hp':2710, 'atk':2005, 're':683, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'kir': 2, '2way': 3}},
		2811:{'nm':'神聖の風紀委員長・アテナ','main':3,'sub':3, 'hp':2710, 'atk':2005, 're':683, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'kir': 2, '2way': 3}},
		2812:{'nm':'才色兼備の特待生・イシス','main':2,'sub':5, 'hp':2538, 'atk':1655, 're':673, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'yb': 1, '2way': 1, 'mz': 2}},
		2813:{'nm':'軽音部の麒麟姫・サクヤ','main':2,'sub':3, 'hp':3378, 'atk':1570, 're':504, 'aw':{'huin': 1, 'skb': 1, 'bire': 1, 'dk': 1, 'yb': 1, 'gls': 1, 'jm': 1, '2way': 2}},
		2814:{'nm':'図書室の管理神・カーリー','main':3,'sub':5, 'hp':3325, 'atk':1774, 're':355, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'kir': 2, 'yb': 2}},
		2815:{'nm':'新聞部の特命記者・猿飛佐助','main':2,'sub':3, 'hp':2397, 'atk':1886, 're':216, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'mzr': 1, '2way': 1}},
		2816:{'nm':'飼育部の元気娘・赤ずきん','main':1,'sub':1, 'hp':3003, 'atk':810, 're':511, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'hir': 1, 'hi': 1}},
		2817:{'nm':'占い部の名物部長・白雪姫','main':2,'sub':2, 'hp':2851, 'atk':8635, 're':22, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'mzr': 1, 'mz': 1}},
		2818:{'nm':'帰宅部のおてんば娘・おやゆび姫','main':3,'sub':3, 'hp':1415, 'atk':1613, 're':504, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'ki': 1, '2way': 1}},
		2819:{'nm':'演劇部のヒロイン・シンデレラ','main':4,'sub':4, 'hp':3030, 'atk':8025, 're':07, 'aw':{'birs': 2, 'skb': 1, 'yb': 1, 'hk': 1, '2way': 1}},
		2820:{'nm':'読書部の才媛・ねむり姫','main':5,'sub':5, 'hp':2530, 'atk':1372, 're':315, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'ym': 1, '2way': 1}},
		2821:{'nm':'バレー部の悪魔・テウルギア','main':1,'sub':3, 'hp':2650, 'atk':1700, 're':246, 'aw':{'huin': 1, 'skb': 1, 'hi': 5, 'ki': 2}},
		2824:{'nm':'メトロポリスの守護者・スーパーマン','main':4,'sub':1, 'hp':3915, 'atk':1977, 're':110, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'hkr': 2, '2way': 1}},
		2827:{'nm':'アーマード・バットマン','main':5,'sub':0, 'hp':4515, 'atk':2003, 're':285, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'skb': 1}},
		2838:{'nm':'忠心の白猿臣・ハヌマーン','main':3,'sub':2, 'hp':4512, 'atk':1703, 're':-100, 'aw':{'kir': 4, 'yb': 1, 'gls': 2}},
		2840:{'nm':'慈悲の心・殺生丸','main':5,'sub':4, 'hp':3638, 'atk':1555, 're':328, 'aw':{'huin': 1, 'skb': 2, '2way': 2}},
		2842:{'nm':'浄化の力・桔梗','main':4,'sub':5, 'hp':2328, 'atk':1193, 're':553, 'aw':{'huin': 3}},
		2844:{'nm':'符咒士・ヒョウ','main':5,'sub':5, 'hp':2685, 'atk':1810, 're':213, 'aw':{'huin': 1, 'kilr': 1, 'birs': 2}},
		2846:{'nm':'麗の首領・紅麗','main':1,'sub':5, 'hp':2405, 'atk':1778, 're':320, 'aw':{'huin': 1, 'hir': 3}},
		2854:{'nm':'魔装フォカロル・シンドバッド','main':3,'sub':5, 'hp':3716, 'atk':1705, 're':314, 'aw':{'huin': 2, 'birs': 2, 'skb': 2, '2way': 1}},
		2856:{'nm':'魔装ザガン・練白龍','main':3,'sub':5, 'hp':2613, 'atk':1678, 're':173, 'aw':{'yb': 3}},
		2862:{'nm':'迷宮なしの名探偵・江戸川コナン','main':2,'sub':4, 'hp':2650, 'atk':1588, 're':373, 'aw':{'huin': 3, 'yb': 1}},
		2891:{'nm':'光の星導機・オルファリオン','main':4,'sub':0, 'hp':6002, 'atk':1917, 're':200, 'aw':{'huin': 1, 'birs': 2, 'skb': 3, 'yb': 1, 'hk': 1, '2way': 1}},
		2892:{'nm':'開眼の瞑想神・サンダルフォン','main':4,'sub':2, 'hp':2745, 'atk':1307, 're':705, 'aw':{'huin': 1, 'birs': 2, 'hkr': 1, 'hk': 1}},
		2893:{'nm':'魂縛の黒冥姫・ヘル','main':5,'sub':4, 'hp':4018, 'atk':1855, 're':20, 'aw':{'huin': 1, 'skb': 1, 'ym': 2, '2way': 2}},
		2894:{'nm':'忠実の魔公子・コシュまる','main':3,'sub':5, 'hp':4035, 'atk':1619, 're':150, 'aw':{'re': 1, 'skb': 2, 'kir': 2}},
		2900:{'nm':'神討の魔狼・フェンリル＝ヴィズ','main':4,'sub':2, 'hp':4666, 'atk':1449, 're':111, 'aw':{'huin': 2, 'kilr': 1, 'skb': 1, 'yb': 2}},
		2901:{'nm':'覚醒曹操','main':1,'sub':1, 'hp':4395, 'atk':1856, 're':27, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'hir': 2, 'hi': 2}},
		2902:{'nm':'覚醒孫権','main':2,'sub':1, 'hp':3815, 'atk':1183, 're':590, 'aw':{'huin': 1, 'skb': 1, 'mzr': 1, 'gls': 1, '2way': 3, 'mz': 1}},
		2903:{'nm':'覚醒劉備','main':3,'sub':3, 'hp':4125, 'atk':1845, 're':103, 'aw':{'birs': 2, 'skb': 2, 'kir': 2, 'jm': 1, 'ki': 1}},
		2904:{'nm':'覚醒大喬＆小喬','main':4,'sub':2, 'hp':3215, 'atk':1421, 're':641, 'aw':{'huin': 1, 'skb': 1, 'mzr': 2, 'hkr': 3, 'yb': 1}},
		2905:{'nm':'凶星の飛将神・呂布','main':5,'sub':1, 'hp':3813, 'atk':2293, 're':0, 'aw':{'huin': 1, 'ymr': 2, 'birs': 2, 'skb': 2, 'bire': 1, 'ym': 1}},
		2916:{'nm':'歴戦の皇帝・ナポレオン','main':1,'sub':4, 'hp':3412, 'atk':1801, 're':88, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hi': 5}},
		2918:{'nm':'蛮力の赤髭・バルバロッサ','main':2,'sub':1, 'hp':4221, 'atk':1542, 're':0, 'aw':{'huin': 2, 'kilr': 1, 'yb': 1, '2way': 3}},
		2920:{'nm':'神業の義賊・ロビンフッド','main':3,'sub':1, 'hp':3198, 'atk':1453, 're':388, 'aw':{'huin': 2, 'kilr': 1, 'skb': 1, 'yb': 1, '2way': 2}},
		2922:{'nm':'美玉の寵姫・楊貴妃','main':4,'sub':3, 'hp':3614, 'atk':1350, 're':330, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'yb': 1, '2way': 1}},
		2924:{'nm':'反乱の天魔・織田信長','main':5,'sub':1, 'hp':2899, 'atk':1706, 're':301, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 2, 'birs': 2, 'yb': 1}},
		2925:{'nm':'残光の破壊龍・アポカリプス','main':4,'sub':4, 'hp':4000, 'atk':1650, 're':179, 'aw':{'huin': 1, 'skb': 2, 'hkr': 2, 'gls': 1, '2way': 2}},
		2927:{'nm':'白光炎隼神のアーマー・エース','main':1,'sub':4, 'hp':3905, 'atk':1974, 're':90, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 2, '2way': 2}},
		2929:{'nm':'月下の愛猫神のアーマー・エース','main':3,'sub':5, 'hp':3810, 'atk':1507, 're':385, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 2, 'ki': 2}},
		2939:{'nm':'宝剣龍・ドラクリスト','main':1,'sub':3, 'hp':2742, 'atk':1798, 're':52, 'aw':{'hir': 5, 'kir': 4}},
		2940:{'nm':'絶海龍・ウェルドール','main':2,'sub':4, 'hp':4514, 'atk':986, 're':0, 'aw':{'skb': 5}},
		2941:{'nm':'緑冥龍・ラグウェル','main':3,'sub':2, 'hp':2716, 'atk':1387, 're':302, 'aw':{'huin': 5}},
		2945:{'nm':'鋼杖の龍機神・バルボワ','main':3,'sub':2, 'hp':3624, 'atk':1524, 're':252, 'aw':{'huin': 1, 'kilr': 2, 'skb': 2}},
		2948:{'nm':'超覚醒ゼウス・ディオス','main':3,'sub':4, 'hp':3682, 'atk':1418, 're':514, 'aw':{'skb': 2, 'kir': 1, 'mlb': 1, 'ki': 2}},
		2949:{'nm':'聖鐘の花嫁・エスカマリ','main':4,'sub':4, 'hp':3805, 'atk':1555, 're':293, 'aw':{'huin': 1, 'skb': 1, 'hk': 7}},
		2950:{'nm':'疾走する新郎・ガディウス','main':4,'sub':1, 'hp':3063, 'atk':1204, 're':753, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, 'hkr': 2, 'yb': 1, 'hk': 1}},
		2951:{'nm':'無邪気な新婦・サツキ','main':4,'sub':5, 'hp':4005, 'atk':1703, 're':146, 'aw':{'huin': 1, 'skb': 1, '2way': 3}},
		2952:{'nm':'可憐な花嫁・バステト','main':4,'sub':3, 'hp':3560, 'atk':1457, 're':485, 'aw':{'huin': 1, 'skb': 1, 'dk': 2, 'yb': 2, 'hk': 1, '2way': 1}},
		2953:{'nm':'情熱の太陽神・ラー','main':1,'sub':4, 'hp':4355, 'atk':1300, 're':366, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'yb': 1, 'hi': 1, 'gls': 1}},
		2954:{'nm':'深愛の新郎・明智光秀','main':4,'sub':4, 'hp':2828, 'atk':1719, 're':189, 'aw':{'huin': 1, 'skb': 1, 'hkr': 2}},
		2969:{'nm':'星刻の時龍契士・ミル','main':4,'sub':0, 'hp':4580, 'atk':1710, 're':660, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'hkr': 1, 'hk': 3, '2way': 1}},
		2970:{'nm':'緋空の焔龍喚士・ツバキ','main':1,'sub':4, 'hp':4013, 'atk':1658, 're':298, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 1, 'hk': 2, 'hi': 3}},
		2971:{'nm':'藍海の水龍喚士・スミレ','main':2,'sub':4, 'hp':4803, 'atk':1305, 're':121, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, 'ht': 1, 'mz': 4}},
		2972:{'nm':'碧地の風龍喚士・カエデ','main':3,'sub':4, 'hp':4130, 'atk':1840, 're':281, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, 'ki': 2, '2way': 3}},
		2979:{'nm':'覚醒インドラ','main':4,'sub':3, 'hp':4550, 'atk':1427, 're':219, 'aw':{'huin': 2, 'skb': 2, 'yb': 2, '2way': 2}},
		2980:{'nm':'覚醒ヴリトラ','main':5,'sub':1, 'hp':4067, 'atk':1845, 're':111, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 4, 'skb': 2}},
		2981:{'nm':'覚醒アメノウズメ','main':1,'sub':5, 'hp':4545, 'atk':1325, 're':301, 'aw':{'birs': 2, 're': 2, 'skb': 1, 'hir': 2, 'hi': 1}},
		2982:{'nm':'覚醒ウミサチヤマサチ','main':2,'sub':5, 'hp':3355, 'atk':1551, 're':551, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'gls': 2, '2way': 2, 'mz': 1}},
		2983:{'nm':'覚醒クシナダヒメ','main':3,'sub':4, 'hp':4305, 'atk':1632, 're':610, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, 'ht': 1, 'ki': 1}},
		2984:{'nm':'覚醒イザナギ','main':4,'sub':2, 'hp':3795, 'atk':1566, 're':375, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'ht': 1, 'hk': 2, '2way': 2}},
		2985:{'nm':'覚醒オオクニヌシ','main':5,'sub':3, 'hp':5145, 'atk':1479, 're':54, 'aw':{'huin': 2, 'skb': 2, 'ym': 1, 'yb': 2, '2way': 1}},
		2987:{'nm':'鉄機王・スタージャスティス','main':3,'sub':4, 'hp':4442, 'atk':1493, 're':46, 'aw':{'birs': 2, 'skb': 2, 'kir': 1, 'yb': 1}},
		2989:{'nm':'鉄機帝・アナザージャスティス','main':2,'sub':5, 'hp':3484, 'atk':2008, 're':155, 'aw':{'huin': 2, 'birs': 2, 'skb': 1, 'yb': 1, '2way': 1}},
		2991:{'nm':'狂面の魔公爵・ダンタリオン','main':1,'sub':0, 'hp':4504, 'atk':2303, 're':266, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'hi': 5}},
		2993:{'nm':'愛楽の魔君主・シトリー','main':2,'sub':0, 'hp':3306, 'atk':1442, 're':835, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'mz': 3}},
		2995:{'nm':'爆叫の魔伯爵・ロノウェ','main':3,'sub':0, 'hp':3211, 'atk':1702, 're':696, 'aw':{'huin': 1, 'skb': 2, 'yb': 2}},
		2997:{'nm':'宝冠の聖魔王・パイモン','main':4,'sub':0, 'hp':5502, 'atk':1745, 're':302, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, 'hk': 4}},
		2999:{'nm':'冥瞳の魔神爵・グレモリー','main':5,'sub':0, 'hp':4602, 'atk':1701, 're':600, 'aw':{'huin': 1, 'ymr': 1, 'birs': 2, 'skb': 1, 'yb': 1}},
		3007:{'nm':'閃光の冒険野郎ヴァン・クロウ','main':4,'sub':3, 'hp':3615, 'atk':1810, 're':120, 'aw':{'huin': 1, 'skb': 2, 'bire': 1, 'yb': 1, 'mlb': 1, '2way': 1}},
		3011:{'nm':'アハトロス','main':2,'sub':0, 'hp':3342, 'atk':1522, 're':506, 'aw':{'birs': 2, 'skb': 1, 'gls': 2, 'mz': 3}},
		3012:{'nm':'ディエイク','main':4,'sub':0, 'hp':3950, 'atk':1485, 're':328, 'aw':{'huin': 2, 'skb': 1, 'yb': 2, 'hk': 3}},
		3013:{'nm':'岩鱗の海龍帝・ディエイトロス','main':4,'sub':2, 'hp':4250, 'atk':1685, 're':378, 'aw':{'huin': 1, 'skb': 1, 'hk': 3, 'mz': 3}},
		3015:{'nm':'闘機王・リバティーガイスト','main':1,'sub':3, 'hp':3525, 'atk':1859, 're':98, 'aw':{'huin': 1, 'skb': 1, 'yb': 1, 'mlb': 1, '2way': 2}},
		3017:{'nm':'闘機帝・アナザーガイスト','main':5,'sub':4, 'hp':4369, 'atk':1794, 're':35, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'mlb': 1, '2way': 2}},
		3019:{'nm':'流浪人・緋村剣心','main':1,'sub':4, 'hp':4012, 'atk':1501, 're':354, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, 'hk': 2, 'hi': 3}},
		3021:{'nm':'神谷活心流師範代・神谷薫','main':2,'sub':4, 'hp':2373, 'atk':1625, 're':113, 'aw':{'skb': 1, 'mzr': 2, 'hk': 3, 'mz': 3}},
		3023:{'nm':'神谷活心流門下生・明神弥彦','main':4,'sub':1, 'hp':2698, 'atk':1863, 're':23, 'aw':{'kilr': 1, 'skb': 1, '2way': 1}},
		3025:{'nm':'喧嘩屋・相楽左之助','main':3,'sub':1, 'hp':3610, 'atk':1593, 're':65, 'aw':{'kilr': 2, 'skb': 2}},
		3045:{'nm':'十本刀"明王"・悠久山安慈','main':5,'sub':5, 'hp':3855, 'atk':1453, 're':65, 'aw':{'skb': 1, '2way': 1}},
		3053:{'nm':'灼球の星機神・アンタレス','main':1,'sub':4, 'hp':2988, 'atk':1973, 're':158, 'aw':{'huin': 2, 'skb': 1, 'ht': 2, 'hi': 2}},
		3054:{'nm':'灼鎌の星機神・アンタレス','main':1,'sub':3, 'hp':2788, 'atk':2173, 're':108, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'ht': 2, 'hi': 2}},
		3055:{'nm':'爽河の星機神・アルレシャ','main':2,'sub':3, 'hp':3128, 'atk':1503, 're':408, 'aw':{'huin': 2, 'skb': 1, 'ht': 2, 'mz': 2}},
		3056:{'nm':'霊河の星機神・アルレシャ','main':2,'sub':5, 'hp':2928, 'atk':1703, 're':348, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'ht': 2, 'mz': 2}},
		3057:{'nm':'幽樹の星機神・スピカ','main':3,'sub':5, 'hp':3220, 'atk':1585, 're':333, 'aw':{'huin': 2, 'skb': 1, 'ht': 2, 'ki': 2}},
		3058:{'nm':'命樹の星機神・スピカ','main':3,'sub':2, 'hp':3020, 'atk':1735, 're':303, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'ht': 2, 'ki': 2}},
		3059:{'nm':'奏空の星機神・ポルックス','main':4,'sub':1, 'hp':3023, 'atk':1785, 're':263, 'aw':{'huin': 2, 'skb': 1, 'ht': 2, 'hk': 2}},
		3060:{'nm':'奏冥の星機神・ポルックス','main':4,'sub':5, 'hp':2823, 'atk':1935, 're':243, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'ht': 2, 'hk': 2}},
		3061:{'nm':'滅砲の星機神・カストル','main':5,'sub':2, 'hp':2733, 'atk':2080, 're':178, 'aw':{'huin': 2, 'skb': 1, 'ym': 2, 'ht': 2}},
		3062:{'nm':'滅刃の星機神・カストル','main':5,'sub':4, 'hp':2583, 'atk':2330, 're':78, 'aw':{'huin': 2, 'kilr': 1, 'skb': 2, 'ym': 2, 'ht': 2}},
		3068:{'nm':'灼天の勇将神・クリシュナ','main':1,'sub':1, 'hp':3735, 'atk':1767, 're':353, 'aw':{'huin': 1, 'skb': 1, 'hir': 1, 'yb': 1, 'hi': 5}},
		3069:{'nm':'聖徳の麗女神・サラスヴァティ','main':2,'sub':2, 'hp':3815, 'atk':1300, 're':608, 'aw':{'huin': 1, 'skb': 3, 'mzr': 2, 'yb': 2, 'mz': 1}},
		3070:{'nm':'均衡の創界神・ヴィシュヌ','main':3,'sub':3, 'hp':3565, 'atk':1930, 're':306, 'aw':{'huin': 2, 'skb': 1, 'yb': 2, 'ki': 1, '2way': 3}},
		3071:{'nm':'財成の学問神・ガネーシャ','main':4,'sub':4, 'hp':2725, 'atk':1768, 're':670, 'aw':{'huin': 2, 'birs': 2, 'skb': 1, 'yb': 1, 'jm': 1, '2way': 2}},
		3072:{'nm':'殲掌の討女神・ドゥルガー','main':5,'sub':2, 'hp':3823, 'atk':1922, 're':223, 'aw':{'huin': 2, 'skb': 2, 'yb': 1, 'gls': 2, '2way': 2}},
		3074:{'nm':'覚醒マシンアテナ','main':3,'sub':0, 'hp':3900, 'atk':2650, 're':240, 'aw':{'kilr': 1, 'birs': 2, 'skb': 1, 'kir': 1, 'ki': 2, '2way': 2}},
		3076:{'nm':'拳王をめざした男・トキ','main':2,'sub':4, 'hp':2315, 'atk':1807, 're':632, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'mzr': 1, 'yb': 1}},
		3078:{'nm':'南斗五車星・風のヒューイ','main':3,'sub':3, 'hp':2375, 'atk':1705, 're':215, 'aw':{'skb': 1, 'mlb': 1, 'ki': 3}},
		3080:{'nm':'南斗五車星・炎のシュレン','main':1,'sub':1, 'hp':2458, 'atk':1993, 're':15, 'aw':{'skb': 1, 'hi': 3, 'mlb': 1}},
		3082:{'nm':'ケンを慕う少女・リン','main':4,'sub':1, 'hp':2198, 'atk':805, 're':598, 'aw':{'huin': 1, 'birs': 2, 'skb': 1}},
		3083:{'nm':'凶災の幻影龍・アニマ','main':1,'sub':5, 'hp':3275, 'atk':1784, 're':296, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'hir': 1}},
		3084:{'nm':'禍乱の不死龍・カースドラゴン','main':5,'sub':5, 'hp':5033, 'atk':1354, 're':25, 'aw':{'kilr': 1, 're': 1, 'skb': 1, '2way': 1}},
		3085:{'nm':'破軍・ドラゴン・ショウグン','main':5,'sub':5, 'hp':3718, 'atk':1643, 're':56, 'aw':{'ymr': 1, 'skb': 1, '2way': 1}},
		3088:{'nm':'神命姫神のアーマー・アナ','main':4,'sub':3, 'hp':2508, 'atk':1639, 're':686, 'aw':{'skb': 1, 'yb': 1, 'ht': 1, 'hk': 3, '2way': 1}},
		3089:{'nm':'ホーリーセレスのアーマー・アナ','main':3,'sub':4, 'hp':3074, 'atk':1261, 're':771, 'aw':{'huin': 1, 'kilr': 2, 'birs': 2, 'skb': 1, '2way': 1}},
		3090:{'nm':'滅法の黒龍契士のアーマー・アナ','main':5,'sub':2, 'hp':4213, 'atk':1696, 're':386, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 1, '2way': 1}},
		3091:{'nm':'大灼熱・クレナイゴウカミ','main':1,'sub':4, 'hp':2351, 'atk':1761, 're':64, 'aw':{'skb': 1, 'hir': 1, 'hi': 1}},
		3092:{'nm':'剣氷山・シラハ','main':2,'sub':5, 'hp':3279, 'atk':1123, 're':169, 'aw':{'skb': 1, 'mzr': 1, 'mz': 1}},
		3093:{'nm':'碧辻風・アデカザキリ','main':3,'sub':2, 'hp':2012, 'atk':1022, 're':611, 'aw':{'skb': 1, 'kir': 1, 'ki': 1}},
		3095:{'nm':'タマゾーX覚醒オーディン','main':3,'sub':4, 'hp':3601, 'atk':1103, 're':364, 'aw':{'birs': 2, 'ki': 7}},
		3096:{'nm':'青龍契士・ミニりゅーね','main':2,'sub':2, 'hp':3009, 'atk':1695, 're':191, 'aw':{'skb': 1, 'mz': 5}},
		3097:{'nm':'緑龍契士・ミニしるびぃ','main':3,'sub':3, 'hp':2795, 'atk':1767, 're':213, 'aw':{'skb': 1, 'ki': 5}},
		3098:{'nm':'橙龍契士・ミニさりあ','main':4,'sub':4, 'hp':3759, 'atk':1374, 're':73, 'aw':{'skb': 1, 'hk': 4}},
		3099:{'nm':'秘女神・ミニかーりー','main':4,'sub':4, 'hp':2582, 'atk':1240, 're':502, 'aw':{'kilr': 3}},
		3100:{'nm':'龍喚士・ミニそにあ＝ぐらん＝りばーす','main':5,'sub':4, 'hp':2458, 'atk':1305, 're':300, 'aw':{'kilr': 1, 'skb': 2, 'yb': 1}},
		3101:{'nm':'烈士の勇猛神・真田幸村','main':1,'sub':1, 'hp':2968, 'atk':2226, 're':203, 'aw':{'huin': 1, 'skb': 2, 'hir': 5}},
		3102:{'nm':'鬼気の勇猛神・真田幸村','main':1,'sub':5, 'hp':3668, 'atk':1876, 're':203, 'aw':{'huin': 1, 'skb': 1, 'hir': 2, 'hi': 3}},
		3103:{'nm':'観想の智謀神・毛利元就','main':2,'sub':2, 'hp':4135, 'atk':1356, 're':196, 'aw':{'huin': 1, 'skb': 2, 'mzr': 4}},
		3104:{'nm':'果断の智謀神・毛利元就','main':2,'sub':1, 'hp':3235, 'atk':1806, 're':196, 'aw':{'huin': 1, 'skb': 1, 'mzr': 2, '2way': 1}},
		3105:{'nm':'情義の諜報神・石田三成','main':3,'sub':3, 'hp':2025, 'atk':2083, 're':391, 'aw':{'huin': 1, 'skb': 2, 'kir': 4}},
		3106:{'nm':'圧制の諜報神・石田三成','main':3,'sub':5, 'hp':2525, 'atk':1933, 're':331, 'aw':{'huin': 1, 'skb': 1, 'kir': 2, '2way': 1}},
		3107:{'nm':'燦爛の傾奇神・前田慶次','main':4,'sub':1, 'hp':3220, 'atk':1524, 're':368, 'aw':{'huin': 2, 'kilr': 1, 'skb': 1, 'yb': 1, '2way': 2}},
		3108:{'nm':'豪壮の傾奇神・前田慶次','main':4,'sub':5, 'hp':3020, 'atk':1724, 're':308, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, '2way': 1}},
		3109:{'nm':'周到の謀略神・明智光秀','main':5,'sub':5, 'hp':3128, 'atk':1869, 're':189, 'aw':{'huin': 1, 'ymr': 4, 'skb': 2}},
		3110:{'nm':'憂愁の謀略神・明智光秀','main':5,'sub':4, 'hp':3028, 'atk':1719, 're':309, 'aw':{'huin': 1, 'ymr': 2, 'skb': 1, 'ym': 2}},
		3111:{'nm':'楽園の守護者・メタトロン','main':2,'sub':4, 'hp':2454, 'atk':1430, 're':893, 'aw':{'huin': 2, 'birs': 2, 're': 1, 'skb': 2, 'bire': 1}},
		3112:{'nm':'休息の狙撃手・ミル','main':2,'sub':0, 'hp':4580, 'atk':1710, 're':660, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'mzr': 1, '2way': 1, 'mz': 3}},
		3113:{'nm':'渚の星女神・エスカマリ','main':2,'sub':2, 'hp':3805, 'atk':1555, 're':293, 'aw':{'huin': 1, 'skb': 1, 'mz': 7}},
		3114:{'nm':'楽園の玄武姫・メイメイ','main':2,'sub':3, 'hp':3475, 'atk':1464, 're':336, 'aw':{'skb': 1, 'yb': 1, 'hk': 1, 'ki': 1, 'mz': 5}},
		3118:{'nm':'破天荒の波乗り・石川五右衛門','main':1,'sub':2, 'hp':3778, 'atk':1259, 're':217, 'aw':{'skb': 2, 'hir': 2}},
		3119:{'nm':'夕涼の魔導姫・アルマデル','main':3,'sub':2, 'hp':2645, 'atk':1245, 're':279, 'aw':{'huin': 1, 'skb': 1, 'ki': 5, 'mz': 2}},
		3120:{'nm':'休翼の龍喚士・ナヴィ','main':2,'sub':4, 'hp':3385, 'atk':1535, 're':124, 'aw':{'skb': 2, 'mzr': 3, 'ht': 3, 'mlb': 1}},
		3125:{'nm':'奇跡の逆転ファイター・キン肉マン','main':1,'sub':4, 'hp':4315, 'atk':1760, 're':65, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 2, '2way': 2}},
		3127:{'nm':'超人血盟軍・大将・キン肉マンソルジャー','main':3,'sub':4, 'hp':3813, 'atk':1840, 're':163, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 2}},
		3129:{'nm':'悪魔超人最後の刺客・悪魔将軍','main':5,'sub':5, 'hp':3255, 'atk':2173, 're':120, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'skb': 2, 'yb': 2}},
		3151:{'nm':'優遊の玄武姫・メイメイ','main':3,'sub':2, 'hp':3475, 'atk':1464, 're':336, 'aw':{'skb': 1, 'yb': 1, 'hk': 1, 'ki': 5, 'mz': 1}},
		3157:{'nm':'閃機帝・アナザークルセイダー','main':3,'sub':2, 'hp':3002, 'atk':1915, 're':353, 'aw':{'2way':1, 'skb': 2, 'yb': 1, 'huin': 1, 'dk': 1, 'mlb': 1}},
		3159:{'nm':'暁天の蒼空神・ケプリ','main':2,'sub':4, 'hp':3230, 'atk':1903, 're':273, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'bire': 1, 'yb': 2}},
		3162:{'nm':'タマゾーX覚醒幻神・オーディン','main':1,'sub':5, 'hp':3014, 'atk':1851, 're':55, 'aw':{'birs': 2, 'skb': 2, 'hi': 5}},
		3163:{'nm':'タマゾーX覚醒秘神・オーディン','main':2,'sub':5, 'hp':4013, 'atk':1103, 're':202, 'aw':{'birs': 2, 'skb': 2, 'yb': 2, 'mz': 3}},
		3165:{'nm':'邪眼大帝ラスト・ロマノフ','main':5,'sub':2, 'hp':3205, 'atk':1933, 're':262, 'aw':{'kilr': 1, 'ymr': 3, 'skb': 2, 'yb': 1}},
		3166:{'nm':'燃える革命ドギラゴン','main':1,'sub':1, 'hp':3440, 'atk':1945, 're':75, 'aw':{'huin': 1, 'skb': 2, 'hir': 2, 'yb': 1}},
		3167:{'nm':'蒼き団長ドギラゴン剣','main':1,'sub':3, 'hp':3340, 'atk':1645, 're':285, 'aw':{'huin': 1, 'skb': 1, 'hir': 2, 'kir': 2}},
		3173:{'nm':'冥道の根源神・イザナギX','main':5,'sub':1, 'hp':3645, 'atk':1616, 're':415, 'aw':{'huin': 2, 'skb': 2, 'ym': 1, 'yb': 1, '2way': 3}},
		3175:{'nm':'紫光の深淵龍・アポカリプスX','main':5,'sub':4, 'hp':4000, 'atk':1650, 're':179, 'aw':{'huin': 1, 'ymr': 2, 'skb': 2, 'hkr': 2, '2way': 2}},
		3198:{'nm':'降魔の神・降三世明王','main':1,'sub':5, 'hp':4043, 'atk':1448, 're':13, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, 'mlb': 1, '2way': 1}},
		3200:{'nm':'息災の神・軍荼利明王','main':2,'sub':3, 'hp':2855, 'atk':1698, 're':220, 'aw':{'huin': 2, 'skb': 1, 'yb': 1, 'mlb': 1, '2way': 1}},
		3202:{'nm':'慈悲の神・不動明王','main':3,'sub':1, 'hp':3240, 'atk':1508, 're':210, 'aw':{'huin': 1, 'skb': 1, 'yb': 3, 'mlb': 1}},
		3204:{'nm':'智慧の神・金剛夜叉明王','main':4,'sub':2, 'hp':3093, 'atk':1755, 're':113, 'aw':{'huin': 1, 'skb': 2, 'yb': 2, 'mlb': 1}},
		3206:{'nm':'畏怖の神・大威徳明王','main':5,'sub':4, 'hp':2805, 'atk':1840, 're':148, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, 'mlb': 1, '2way': 1}},
		3218:{'nm':'最強装備・魔砲士','main':1,'sub':4, 'hp':3820, 'atk':1905, 're':103, 'aw':{'huin': 1, 'skb': 1, 'yb': 3}},
		3221:{'nm':'蒼響の龍楽士・ミオン','main':2,'sub':3, 'hp':3560, 'atk':1584, 're':374, 'aw':{'huin': 1, 'skb': 1, 'dk': 2, 'mzr': 2, 'yb': 1}},
		3222:{'nm':'紅蘭の黒魔女・シャンメイ','main':5,'sub':0, 'hp':2812, 'atk':1903, 're':1001, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'skb': 2, 'yb': 1}},
		3223:{'nm':'古城の居候・ソニア＝グラン','main':4,'sub':5, 'hp':3778, 'atk':1658, 're':271, 'aw':{'huin': 1, 'kilr': 1, 'skb': 1, 'yb': 2, '2way': 1}},
		3224:{'nm':'演舞の青龍姫・カリン','main':2,'sub':5, 'hp':3345, 'atk':1631, 're':284, 'aw':{'skb': 1, 'ym': 1, 'yb': 1, 'ki': 1, 'mz': 5}},
		3225:{'nm':'仮装祭の小悪魔・ロズエル','main':5,'sub':1, 'hp':3720, 'atk':1613, 're':90, 'aw':{'birs': 2, 'skb': 1, 'bire': 1, '2way': 3}},
		3226:{'nm':'御茶屋の看板娘・望月千代女','main':5,'sub':1, 'hp':3238, 'atk':1490, 're':383, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'skb': 2, '2way': 1}},
		3227:{'nm':'仮装祭の女神・パールヴァティー','main':3,'sub':5, 'hp':3543, 'atk':1226, 're':483, 'aw':{'kilr': 2, 'dk': 3, '2way': 1}},
		3233:{'nm':'朝陽の日龍喚士・カンナ','main':4,'sub':4, 'hp':3878, 'atk':1660, 're':403, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, '2way': 4}},
		3234:{'nm':'夜陰の日龍喚士・カンナ','main':5,'sub':4, 'hp':3378, 'atk':2010, 're':353, 'aw':{'huin': 1, 'skb': 2, 'yb': 1, '2way': 3}},
		3235:{'nm':'魔究の狂幻魔・イルム','main':4,'sub':1, 'hp':4275, 'atk':1759, 're':311, 'aw':{'huin': 1, 'kilr': 1, 'skb': 2, 'hkr': 1, 'yb': 1, '2way': 1}},
		3236:{'nm':'人世の妖幻魔・イルム','main':4,'sub':0, 'hp':4545, 'atk':2059, 're':401, 'aw':{'huin': 1, 'skb': 2, 'hkr': 3, 'yb': 1, '2way': 2}},
		3237:{'nm':'疾速の龍騎姫・イシュタル','main':3,'sub':0, 'hp':4327, 'atk':1709, 're':138, 'aw':{'kilr': 1, 'skb': 2, '2way': 2}},
		3238:{'nm':'転生ミネルヴァ','main':1,'sub':4, 'hp':4110, 'atk':2109, 're':503, 'aw':{'huin': 1, 'hidec': 1, 'birs': 2, 'skb': 1, 'hir': 1, 'hi': 1, 'jm': 2}},
		3239:{'nm':'転生ネプチューン','main':2,'sub':5, 'hp':3412, 'atk':2351, 're':567, 'aw':{'huin': 1, 'birs': 2, 'skb': 1, 'dk': 2, 'mzr': 1, 'mzdec': 1, 'mz': 1}},
		3240:{'nm':'転生セレス','main':3,'sub':5, 'hp':4094, 'atk':1915, 're':623, 'aw':{'huin': 1, 'birs': 2, 're': 1, 'skb': 1, 'bire': 1, 'kir': 1, 'ht': 1, 'ki': 1}},
		3241:{'nm':'転生シヴァ','main':1,'sub':5, 'hp':4361, 'atk':2615, 're':123, 'aw':{'huin': 1, 'skb': 2, 'yb': 2, 'hi': 2, '2way': 2}},
		3242:{'nm':'転生ラクシュミー','main':2,'sub':4, 'hp':5410, 'atk':1962, 're':200, 'aw':{'huin': 1, 're': 1, 'skb': 2, 'bire': 1, 'mzr': 1, 'yb': 1, '2way': 1, 'mz': 1}},
		3243:{'nm':'転生パールヴァティー','main':3,'sub':4, 'hp':4043, 'atk':1956, 're':613, 'aw':{'birs': 2, 're': 1, 'skb': 1, 'bire': 1, 'dk': 1, 'ki': 1, '2way': 2}},
		3245:{'nm':'爆怒の鉄龍帝・ナインガルダ','main':5,'sub':1, 'hp':4999, 'atk':1089, 're':399, 'aw':{'ymr': 5, 'hir': 4}},
		3246:{'nm':'カーリー【塗り絵コンテスト】','main':2,'sub':3, 'hp':2765, 'atk':1361, 're':603, 'aw':{'huin': 1, 'skb': 1, 'yb': 2, '2way': 2}},
		3247:{'nm':'サクヤ【塗り絵コンテスト】','main':1,'sub':4, 'hp':3528, 'atk':1370, 're':384, 'aw':{'gls':2, 'jm':2, 'birs':2, 'skb':1, 'huin':1, 'yb':1}},
		3249:{'nm':'霊幻の青龍姫・カリン','main':5,'sub':2, 'hp':3345, 'atk':1631, 're':284, 'aw':{'skb': 1, 'ym': 5, 'yb': 1, 'ki': 1, 'mz': 1}},
		3252:{'nm':'覚醒神魔王ミニるしふぁー','main':5,'sub':4, 'hp':2628, 'atk':1406, 're':404, 'aw':{'skb': 3, 'ym': 3}},
		3259:{'nm':'隼護の冥蝎神・セルケト','main':5,'sub':1, 'hp':4125, 'atk':1569, 're':214, 'aw':{'huin': 1, 'skb': 1, 'dk': 3, 'yb': 1, 'jm': 3}},
		3260:{'nm':'大和の焔龍喚士・ツバキ','main':1,'sub':0, 'hp':3813, 'atk':1958, 're':388, 'aw':{'huin': 1, 'kilr': 2, 'skb': 2, 'yb': 1, 'hi': 3}},
		3265:{'nm':'全能神・ラー＝ドラゴン','main':4,'sub':4, 'hp':5605, 'atk':1880, 're':340, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'yb': 2, '2way': 2}},
		3268:{'nm':'浄光の天陽神・アテン','main':4,'sub':1, 'hp':5015, 'atk':605, 're':373, 'aw':{'kilr': 8}},
		3269:{'nm':'転生ヴィーナス','main':4,'sub':4, 'hp':3475, 'atk':1536, 're':1035, 'aw':{'huin': 1, 're': 2, 'skb': 1, 'hkr': 3, 'hk': 1, '2way': 1}},
		3270:{'nm':'転生ハーデス','main':5,'sub':5, 'hp':3370, 'atk':2555, 're':455, 'aw':{'huin': 1, 'ymr': 1, 'skb': 1, 'ym': 2, 'gls': 2, '2way': 2}},
		3271:{'nm':'転生ヒノカグツチ','main':1,'sub':1, 'hp':5550, 'atk':1960, 're':160, 'aw':{'huin': 1, 're': 1, 'skb': 1, 'hir': 1, 'hi': 2, '2way': 3}},
		3272:{'nm':'転生ホルス','main':1,'sub':2, 'hp':3575, 'atk':2164, 're':630, 'aw':{'huin': 2, 'skb': 2, 'yb': 1, 'hi': 2, '2way': 2}},
		3273:{'nm':'転生ラー','main':4,'sub':3, 'hp':5555, 'atk':1548, 're':406, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'yb': 2, 'hk': 1, 'gls': 1}},
		3274:{'nm':'魔導書の幻魔・イルミナ','main':1,'sub':4, 'hp':4185, 'atk':2205, 're':124, 'aw':{'kilr': 3, 'skb': 4, 'yb': 2}},
		3275:{'nm':'裁盤の鋼星神・エルゲヌビ','main':1,'sub':5, 'hp':3295, 'atk':1775, 're':317, 'aw':{'huin': 1, 'skb': 1, 'hi': 7}},
		3276:{'nm':'討弓の鋼星神・メリディオナリス','main':2,'sub':3, 'hp':3875, 'atk':1468, 're':334, 'aw':{'skb': 1, 'mzr': 5}},
		3277:{'nm':'獄幻魔の愛娘・ロミア','main':3,'sub':5, 'hp':3280, 'atk':1562, 're':449, 'aw':{'kilr': 1, 'skb': 1, 'yb': 4}},
		3278:{'nm':'蒼翼の閃龍喚士・ナヴィ','main':4,'sub':2, 'hp':3085, 'atk':1909, 're':292, 'aw':{'huin': 4, 'skb': 2}},
		3279:{'nm':'冥装の龍機工士・バーバラ','main':5,'sub':1, 'hp':3217, 'atk':2106, 're':134, 'aw':{'kilr': 3, 'skb': 3}},
		3280:{'nm':'撃瓶の鋼星神・クヴィア','main':1,'sub':2, 'hp':3217, 'atk':1166, 're':590, 'aw':{'skb': 1, '2way': 4}},
		3281:{'nm':'冷面の魔公女・メル','main':2,'sub':1, 'hp':3224, 'atk':2069, 're':44, 'aw':{'skb': 1, 'ht': 6, '2way': 1}},
		3282:{'nm':'神書の検索者・ミト','main':3,'sub':4, 'hp':2615, 'atk':1163, 're':775, 'aw':{'kilr': 2, 'birs': 2, 'skb': 1}},
		3283:{'nm':'碧地司の龍巫女・モミジ','main':4,'sub':3, 'hp':2637, 'atk':1825, 're':369, 'aw':{'yb': 3, '2way': 2}},
		3284:{'nm':'龍喚士の弟子・シーナ','main':5,'sub':4, 'hp':3931, 'atk':1728, 're':40, 'aw':{'kilr': 2, 'ymr': 2, 'skb': 1}},
		3294:{'nm':'シャーレアンの賢者・ヤ・シュトラ','main':2,'sub':3, 'hp':2608, 'atk':1705, 're':573, 'aw':{'skb': 2, 'yb': 2, 'bire': 2, 'birs':2}},
		3299:{'nm':'想い秘めし者・ティファ','main':4,'sub':1, 'hp':4755, 'atk':1945, 're':109, 'aw':{'hkr': 5, 'yb': 2, 'huin':1,'skb':1}},
		3305:{'nm':'託されし未来の王・ノクティス','main':5,'sub':4, 'hp':4038, 'atk':1877, 're':214, 'aw':{'2way': 2, 'yb': 3, 'huin':1,'kilr':1}},
		3306:{'nm':'グラウカ', 'main':5, 'sub':5, 'hp':3404, 'atk':1615, 're':134, 'aw':{'skb':1, 'ymr':3}},
		3331: { 'nm': '火の古老・エルドラ', 'main': 1, 'sub': 1, 'hp': 3851, 'atk': 1537, 're': 165, 'aw': { 'hi': 3, 'mzdec':3, 'yb':2, 'skb':1} },
		3332: { 'nm': '火古龍・エルドラ', 'main': 1, 'sub': 1, 'hp': 3851, 'atk': 1537, 're': 165, 'aw': { 'hi': 3, 'hidec':3, 'yb':2, 'skb':1} },
		3262:{'nm':'鍛煉神・シヴァ＝ドラゴン','main':1,'sub':5, 'hp':5118, 'atk':2105, 're':218, 'aw':{'huin': 1, 'skb': 2, 'hir': 2, 'yb': 1, '2way': 3}},
		3263:{'nm':'聖舶神・ネプチューン＝ドラゴン','main':2,'sub':5, 'hp':5328, 'atk':1504, 're':521, 'aw':{'huin': 1, 'ymr': 1, 'skb': 2, 'mzr': 4, 'yb': 1}},
		3266:{'nm':'暗黒神・ツクヨミ＝ドラゴン','main':5,'sub':4, 'hp':4901, 'atk':2404, 're':245, 'aw':{'huin': 1, 'birs': 2, 'skb': 2, 'bire': 1, 'ym': 1, 'yb': 2}},
		3353:{'nm':'最後の月牙天衝・黒崎一護','main':5,'sub':2, 'hp':3330, 'atk':1915, 're':428, 'aw':{'huin': 1, 'kilr': 1, 'ymr': 1, 'birs': 2, 'skb': 2, 'yb': 1}},
		3354:{'nm':'完全虚化・黒崎一護','main':5,'sub':5, 'hp':3630, 'atk':1865, 're':468, 'aw':{'huin': 1, 'kilr': 3, 'skb': 1, 'yb': 2, '2way': 2}},
		3355:{'nm':'次の舞『白漣』・朽木ルキア','main':2,'sub':4, 'hp':3515, 'atk':1613, 're':475, 'aw':{'huin': 3, 'skb': 2, 'yb': 1, '2way': 1}},
		3384:{'nm':'転生バステト','main':3,'sub':3, 'hp':4760, 'atk':1757, 're':519, 'aw':{'huin': 1, 'skb': 1, 'dk': 2, 'yb': 2, 'ki': 1, '2way': 2}},
		3385:{'nm':'転生アヌビス','main':5,'sub':5, 'hp':5048, 'atk':1450, 're':618, 'aw':{'huin': 1, 'birs': 2, 're': 2, 'skb': 1, 'bire': 1, 'yb': 2}}
	};
    var sttm = 0; //for requestAnimationFrame
    var is_ld_type = true;
    var msm = ['A', 'B', 'C', 'D', 'E', 'F'];
    var zk_tg_btn = [true, true, true, true, true]; //for selecting monster (toggle button)
    var zk_tg_btn_sub = [true, true, true, true, true, true];
    var max_page = 0;
	var aw_list = {
		'hidec':[0,0,0,0,0,0], 'mzdec':[0,0,0,0,0,0], 'kidec':[0,0,0,0,0,0], 'hkdec':[0,0,0,0,0,0], 'ymdec':[0,0,0,0,0,0],
		'hi':[0,0,0,0,0,0], 'mz':[0,0,0,0,0,0], 'ki':[0,0,0,0,0,0], 'hk':[0,0,0,0,0,0], 'ym':[0,0,0,0,0,0], 'ht':[0,0,0,0,0,0],
		'hir':[0,0,0,0,0,0], 'mzr':[0,0,0,0,0,0], 'kir':[0,0,0,0,0,0], 'hkr':[0,0,0,0,0,0], 'ymr':[0,0,0,0,0,0],
		'2way':[0,0,0,0,0,0], 'skb':[0,0,0,0,0,0], 'mlb':[0,0,0,0,0,0], 'kilr':[0,0,0,0,0,0], 'huin':[0,0,0,0,0,0],
		'jm':[0,0,0,0,0,0], 'dk':[0,0,0,0,0,0], 'gls':[0,0,0,0,0,0], 'birs':[0,0,0,0,0,0], 'bire':[0,0,0,0,0,0],
		'yb':[0,0,0,0,0,0], 're':[0,0,0,0,0,0]
	};
	var status_list = {
		'hp':[0,0,0,0,0,0], 'atk':[1000,1000,1000,1000,1000,1000], 're':[300,300,300,300,300,300]
	};
	/*
	microsoft edgeではworker動く
	var monswork = new Worker("monswork.js");
	monswork.postMessage(mns);
    monswork.onmessage = function(e){
		//console.log(e);
		$('select[name^=nm]').append(e.data);
	};
	*/

    $('#nm1').on('click', function () {
    	selectGUI(1);
    });
    $('#nm2').on('click', function () {
    	selectGUI(2);
    });
    $('#nm3').on('click', function () {
    	selectGUI(3);
    });
    $('#nm4').on('click', function () {
    	selectGUI(4);
    });
    $('#nm5').on('click', function () {
    	selectGUI(5);
    });
    $('#nm6').on('click', function () {
    	selectGUI(6);
    });
    function selectGUI(num) {
    	$('#nm' + num).append('<div class=bk data000='+num+'></div>');
    	sttm = Date.now();
    	requestAnimationFrame(reqAnim);
    };
    function listMons(page, num) {
    	var item = 24;
    	var index = 0;
    	var bgc = '';
    	var hs = '<ul class=page>'
					+ '<li data001=' + (page - 1) + '>previous</li>'
					+ '<li data001=' + (parseInt(page) + 1) + '>next</li>'
				+ '</ul>'
				+ '<ul class=tgl_btn>'
					+ '<li id=tg1>火</li>'
					+ '<li id=tg2>水</li>'
					+ '<li id=tg3>木</li>'
					+ '<li id=tg4>光</li>'
					+ '<li id=tg5>闇</li>'
				+ '</ul>'
				+ '<ul class=tgl_btn_sub>'
					+ '<li id=tg_sub0>無</li>'
					+ '<li id=tg_sub1>火</li>'
					+ '<li id=tg_sub2>水</li>'
					+ '<li id=tg_sub3>木</li>'
					+ '<li id=tg_sub4>光</li>'
					+ '<li id=tg_sub5>闇</li>'
				+ '</ul>'
				+'<ul class=mns_list >';
    	for (var ky in mns) {
    		if (zk_tg_btn[mns[ky]['main']-1] === true && zk_tg_btn_sub[mns[ky]['sub']] === true) {
				if (index >= item * (page - 1) && index < item * page) {
    				bgc = 'z' + mns[ky]['main'] +'_'+mns[ky]['sub'];
    				hs += '<li class='+bgc+'><span>'+ky+':</span><br>'+mns[ky]['nm']+'</li>';
    			}
    			index++;
    		}
    	}
    	if (index % item > 0) {
    		max_page = parseInt(index / item) +1;
    	} else {
    		max_page = parseInt(index / item);
    	}
    	hs += '</ul>';
    	$('.bk').html(hs);
    	for (var i = 0; i < zk_tg_btn.length; i++) {
    		if (zk_tg_btn[i]) $('#tg' + (parseInt(i) + 1)).attr('class', 'on_btn');
    		else $('#tg' + (parseInt(i) + 1)).attr('class','off_btn');
    	}
    	for (var i = 0; i < zk_tg_btn_sub.length; i++) {
    		if (zk_tg_btn_sub[i]) $('#tg_sub' + i).attr('class', 'on_btn');
    		else $('#tg_sub' + i).attr('class', 'off_btn');
    	}
    }
    $('body').on('click', '.mns_list li', function () {
    	var hs_char = $(this).children('span').html();
		var mns_num = hs_char.substring(0, hs_char.length - 1);
		var num = $('.bk').attr('data000');
		var hp = parseInt(mns[mns_num]['hp']);
		var atk = parseInt(mns[mns_num]['atk']);
		var re = parseInt(mns[mns_num]['re']);
		$('.bk').remove();
    	//
    	$('#nm' + num).html(mns[mns_num]['nm']);
    	$('#nm' + num).removeAttr('class');
    	$('#nm' + num).attr('class', 'z' + mns[mns_num]['main'] + '_' + mns[mns_num]['sub']);
    	//main ele
    	$('select[name=main' + num + ']').val(mns[mns_num]['main']);
    	//sub ele
    	$('select[name=sub' + num + ']').val(mns[mns_num]['sub']);
		//for status
		if ($('#pls' + num).prop('checked')) {
			hp += 990;
			atk += 495;
			re += 297;
		}
    	//change atk
    	$('input[name=atk' + num + ']').val(atk);
    	//change recover
    	$('input[name=re' + num + ']').val(re);
    	//change awakens
    	awakensIni(num);
    	for (var k in mns[mns_num]['aw']) {
			//キラーは3個以上刺さらない
			if (k === 'kilr' && mns[mns_num]['aw'][k] >= 3) $('select[name=' + k + num + ']').val(3);
    		$('select[name=' + k + num + ']').val(mns[mns_num]['aw'][k]);
    	}
		//awaken part
		awList(num, mns[mns_num]['aw']);
		//
		statusChange(num, hp, atk, re);
    });
	$('body').on('click', '.page li', function () {
		var page = parseInt($(this).attr('data001'));
		var num = parseInt($('.bk').attr('data000'));
		if (page < 1) {
			page = 1;
		} else if (page > max_page) {
			page = max_page;
    	}
    	listMons(page, num);
    });
	//for toggle button addEventListener
	$('body').on('click', '.tgl_btn li', function () {
		var zk = $(this).attr('id').substr(2, 1);
		//true->false or false->true, because toggle
		zk_tg_btn[zk - 1] = !zk_tg_btn[zk - 1];
		listMons(1, parseInt($('.bk').attr('data000')));
	});
	$('body').on('click', '.tgl_btn_sub li', function () {
		var zk = $(this).attr('id').slice(-1);
		//true->false or false->true, because toggle
		zk_tg_btn_sub[zk] = !zk_tg_btn_sub[zk];
		listMons(1, parseInt($('.bk').attr('data000')));
	});

    $('input[type=checkbox]').on('click', function () {
    	var atr = $(this).attr('id');
    	if (atr.substr(0, 3) === 'pls') {
    		var num = atr.substr(3, 1);
    		var atk = parseInt($('input[name=atk' + num + ']').val());
    		var re = parseInt($('input[name=re' + num + ']').val());
			var pls_hsi = {'atk':0, 'hp':0, 're':0};
    		if ($(this).prop('checked')) {
				pls_hsi['hp'] = 990;
				pls_hsi['atk'] = 495;
				pls_hsi['re'] = 297;
    		} else {
    			pls_hsi['hp'] = -990;
				pls_hsi['atk'] = -495;
				pls_hsi['re'] = -297;
    		}
			$('input[name=atk' + num + ']').val(atk + pls_hsi['atk']);
    		$('input[name=re' + num + ']').val(re + pls_hsi['re']);
    	}
		//change status for awaken list under team table
		statusChange(num, status_list['hp'][num-1]+pls_hsi['hp'], atk + pls_hsi['atk'], re + pls_hsi['re']);
    });
	$('input[type=text]').on('change', function(){
		var num = $(this).attr('name').slice(-1);
		var atk_or_re = $(this).attr('name').slice(0, -1);
		//console.log(num+ " "+atk_or_re);
		status_list[atk_or_re][num - 1] = parseInt($(this).val());
		var sum = 0;
		for (var i=0; i < status_list[atk_or_re].length; i++) {
			sum += status_list[atk_or_re][i];
		}
		$('#status_'+atk_or_re).html(sum);
	});

//コンボの項目
	//属性選んだら色変える && 総コンボ数自動変換
	$('select[name^=zk]').on('change', function () {
		var bgc = '';
		var vl = $(this).val();

		if (0 == vl) {
			$(this).parent().parent().removeAttr('class');
		} else {
    		if (1 == vl) bgc = 'bgc_hi';
    		else if (2 == vl) bgc = 'bgc_mz';
    		else if (3 == vl) bgc = 'bgc_ki';
    		else if (4 == vl) bgc = 'bgc_hk';
    		else if (5 == vl) bgc = 'bgc_ym';
    		else if (6 == vl) bgc = 'bgc_kh';

    		$(this).parent().parent().attr('class', bgc);
    	}
    	var at = $(this).attr('name').substr(2, 1);
		$('#cmb').val(at);
    });


//dmg
    $('#dir_but').on('click', function () {
    	$(this).attr('disabled', 'disabled');
    	$(this).val('計算中');
    	//攻撃力、回復力をもってくる
    	var atks = getAtk();
    	//コンボをもってくる
    	var cmb = getCmb();
		var sk = getLeadSkl();
		
    	var dm_ary = getDm(atks, cmb, sk);
    	//表とpタグに出力(ダメージ)
    	setDm(dm_ary, atks);

    	butUserble();
    });

	//ボタン連打対策（）
    function butUserble() {
    	$('#dir_but').val('この条件でダメージ計算');
    	$('#dir_but').removeAttr('disabled');
    };
	//攻撃力回復力をArrayに入れる
    function getAtk() {
    	var ar = {
    		'atk': {}, 're': {}, 'main': {}, 'sub': {}, '2way': {},
    		'hi':0, 'mz':0, 'ki':0, 'hk':0, 'ym':0, 'ht':0,
    		'hir':0, 'mzr':0, 'kir':0, 'hkr':0, 'ymr':0, 'kilr': {}, 'mlb': {}
    	};
    	for (var i = 1; i <= 6; i++) {
    		ar['atk'][i] = parseInt($('input[name=atk' + i + ']').val());
    		ar['re'][i] = parseInt($('input[name=re' + i + ']').val());
    		ar['main'][i] = parseInt($('select[name=main' + i + ']').val());
    		ar['sub'][i] = parseInt($('select[name=sub' + i + ']').val());
    		ar['2way'][i] = parseInt($('select[name=2way' + i + ']').val());
    		ar['hi'] += parseInt($('select[name=hi' + i + ']').val());
    		ar['mz'] += parseInt($('select[name=mz' + i + ']').val());
    		ar['ki'] += parseInt($('select[name=ki' + i + ']').val());
    		ar['hk'] += parseInt($('select[name=hk' + i + ']').val());
    		ar['ym'] += parseInt($('select[name=ym' + i + ']').val());
    		ar['ht'] += parseInt($('select[name=ht' + i + ']').val());
    		ar['hir'] += parseInt($('select[name=hir' + i + ']').val());
    		ar['mzr'] += parseInt($('select[name=mzr' + i + ']').val());
    		ar['kir'] += parseInt($('select[name=kir' + i + ']').val());
    		ar['hkr'] += parseInt($('select[name=hkr' + i + ']').val());
    		ar['ymr'] += parseInt($('select[name=ymr' + i + ']').val());
    		ar['mlb'][i] = parseInt($('select[name=mlb' + i + ']').val());
    		ar['kilr'][i] = parseInt($('select[name=kilr' + i + ']').val());
    	}
    	return ar;
    }
	//コンボの中身をarrayに入れる
    function getCmb() {
    	var cmb = {
			'num':$('#cmb').val(),
			'rt':{1:0, 2:0, 3:0, 4:0, 5:0}, //列を数えるのはここでやりたい
			1:{'zk':0, 'num':0, 'pls':0},
			2:{'zk':0, 'num':0, 'pls':0},
			3:{'zk':0, 'num':0, 'pls':0},
			4:{'zk':0, 'num':0, 'pls':0},
			5:{'zk':0, 'num':0, 'pls':0},
			6:{'zk':0, 'num':0, 'pls':0},
			7:{'zk':0, 'num':0, 'pls':0},
			8:{'zk':0, 'num':0, 'pls':0},
			9:{'zk':0, 'num':0, 'pls':0},
			10:{'zk':0, 'num':0, 'pls':0}
    	};
    	for (var i=1; i <= 10; i++) {
    		cmb[i]['zk'] = parseInt($('select[name=zk' + i + ']').val());
    		cmb[i]['num'] = $('#cmb_dp'+i).val();
    		cmb[i]['pls'] = $('#cmb_pls'+i).val();
    		if ($('#cmb' + i + 'rt').prop('checked')) {
    			cmb['rt'][cmb[i]['zk']]++; //add retsu
    		}
    	}
		
    	return cmb;
    }
    //リーダースキル倍率を格納する
    function getLeadSkl(){
    	var sk = {
    		'atk':parseFloat($('#leader_atk').val()),
    		're':parseFloat($('#leader_re').val())
    	};
    	if (isNaN(sk['atk'])) {
    		$('#leader_atk').val(1);
    		sk['atk'] = 1;
    	}
    	if (isNaN(sk['re'])) {
    		$('#leader_re').val(1);
    		sk['re'] = 1;
    	}
    	if ($('#ld_type').prop('checked')) {
    		sk['atk'] = Math.pow(sk['atk'], 2);
    		sk['re'] = Math.pow(sk['re'], 2);
    	}
    	
    	return sk;
    }

    $('#tm > p > label').on('click', function () {
    	is_ld_type = !is_ld_type;
    	if (is_ld_type) {
    		$('#tm > p > label').css('background-color', 'white');
    		$('#tm > p > label').css('color', 'blue');
    		$('#tm > p > label').css('box-shadow', '1px 1px 1px 1px inset');
    	} else {
    		$('#tm > p > label').css('background-color', '#ccc');
    		$('#tm > p > label').css('color', 'black');
    		$('#tm > p > label').css('box-shadow', '1px 1px 1px 1px gray');
    	}
    });

	//ダメージ
    function getDm(atks, cmb, sk) {
    	var dm = {
    		'dm':{
    			1:{'main':0, 'sub':0, 're':0},
    			2:{'main':0, 'sub':0, 're':0},
    			3:{'main':0, 'sub':0, 're':0},
    			4:{'main':0, 'sub':0, 're':0},
    			5:{'main':0, 'sub':0, 're':0},
    			6:{'main':0, 'sub':0, 're':0},
    			'sum':{1:0, 2:0, 3:0, 4:0, 5:0, 'dm':0, 6:0}
    		},
    		'cmb':{
    			'hi':0, 'mz':0, 'ki':0, 'hk':0, 'ym':0, 'ht':0, 'sum':parseInt(cmb['num'])
    		}
    	};
		
    	//注意！！！！！！！！！！！！！ここにコンボ10の10がある！！！
    	for (var i=1; i <= 10; i++) {
    		if (0 < cmb[i]['zk']) {
    			var zk = '';
				if (cmb[i]['zk'] == 1) {
					zk = 'hi';
				} else if (cmb[i]['zk'] == 2) {
					zk = 'mz';
				} else if (cmb[i]['zk'] == 3) {
					zk = 'ki';
				} else if (cmb[i]['zk'] == 4) {
					zk = 'hk';
				} else if (cmb[i]['zk'] == 5) {
					zk = 'ym';
    			} else {
    				zk = 'ht';
    			}
    			dm['cmb'][zk]++;
    			for (var j=1; j <= 6; j++) {
					var main_atk = Math.ceil(atks['atk'][j] * sk['atk']);
    				if (atks['main'][j] == cmb[i]['zk']) {
    					if (4 == cmb[i]['num']) {
    						if (cmb[i]['pls'] > 0) {
    							dm['dm'][j]['main']
									+= atks['atk'][j] * 1.25
									* (1 + (dm['cmb']['sum'] - 1) * 0.25)
									* Math.pow(1.5, atks['2way'][j])
									* Math.pow(1.5, atks['mlb'][j])
									* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']])
									* (cmb[i]['pls'] * 0.06 + 1) * (atks[zk] * 0.05 + 1)
									* sk['atk'];
    						} else {
    							dm['dm'][j]['main']
									+= atks['atk'][j] * 1.25
									* (1 + (dm['cmb']['sum'] - 1) * 0.25)
									* Math.pow(1.5, atks['2way'][j])
									* Math.pow(1.5, atks['mlb'][j])
									* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']])
									* sk['atk'];
    						}
    					} else {
    						if (cmb[i]['pls'] > 0) {
    							dm['dm'][j]['main']
									+= atks['atk'][j] //素の攻撃力
									* (1 + (cmb[i]['num'] - 3) * 0.25) //繋げたﾄﾞﾛｯﾌﾟ
									* (1 + (dm['cmb']['sum'] - 1) * 0.25) //コンボ数
									* Math.pow(1.5, atks['mlb'][j]) //マルチブースト
									* Math.pow(3, atks['kilr'][j]) //キラー
									//* (1 + 0.1 * atks[zk + 'r'])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']]) //列強化
									* (cmb[i]['pls'] * 0.06 + 1) * (atks[zk] * 0.05 + 1) //プラスドロップ
									* sk['atk']; //リーダースキル倍率
    						} else {
    							dm['dm'][j]['main']
									+= atks['atk'][j]
									* (1 + (cmb[i]['num'] - 3) * 0.25)
									* (1 + (dm['cmb']['sum'] - 1) * 0.25)
									* Math.pow(1.5, atks['mlb'][j])
									* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']])
									* sk['atk'];
    						}
    					}
    				}
    				//sub
    				if (atks['sub'][j] == cmb[i]['zk']) {
    					var sub_atk = 0;
    					if (atks['sub'][j] == atks['main'][j]) sub_atk = Math.ceil(atks['atk'][j] * 0.1 * sk['atk']);
    					else sub_atk = Math.ceil(atks['atk'][j] * 0.3 * sk['atk']);
   
    					if (4 == cmb[i]['num']) {
    						if (cmb[i]['pls'] > 0) {
    							dm['dm'][j]['sub']
    								+= sub_atk * 1.25
    						 		*(1+(dm['cmb']['sum']-1)*0.25)
    						 		*Math.pow(1.5, atks['2way'][j])
    						 		*Math.pow(1.5, atks['mlb'][j])
    						 		* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']])
    						 		*(cmb[i]['pls']*0.06+1)*(atks[zk]*0.05+1);
    						} else {
    							dm['dm'][j]['sub']
    								+= sub_atk * 1.25
    						 		* (1 + (dm['cmb']['sum'] - 1) * 0.25)
    						 		* Math.pow(1.5, atks['2way'][j])
    						 		* Math.pow(1.5, atks['mlb'][j])
    						 		* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']]);
    						}
    					} else {
    						if (cmb[i]['pls'] > 0) {
    							dm['dm'][j]['sub']
									+= sub_atk
									* (1 + (cmb[i]['num'] - 3) * 0.25)
									* (1 + (dm['cmb']['sum'] - 1) * 0.25)
									* Math.pow(1.5, atks['mlb'][j])
									* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']])
									* (cmb[i]['pls'] * 0.06 + 1) * (atks[zk] * 0.05 + 1);

    						} else {
    							dm['dm'][j]['sub']
									+= sub_atk
									* (1 + (cmb[i]['num'] - 3) * 0.25)
									* (1 + (dm['cmb']['sum'] - 1) * 0.25)
									* Math.pow(1.5, atks['mlb'][j])
									* Math.pow(3, atks['kilr'][j])
									* (1 + 0.1 * atks[zk+'r'] * cmb['rt'][cmb[i]['zk']]);
    						}
    					}
    				}
    				//ht
    				if (6 == cmb[i]['zk']) {
    					if (cmb[i]['pls'] > 0) {
    						dm['dm'][j]['re']
							 += atks['re'][j]
								* (1 + (cmb[i]['num'] - 3) * 0.25)
								* (1 + (dm['cmb']['sum'] - 1) * 0.25)
								* Math.pow(1.5, atks['mlb'][j])
								* (cmb[i]['pls'] * 0.06 + 1) * (atks['ht'] * 0.05 + 1)
								* sk['re'];
    					} else {
    						dm['dm'][j]['re']
							 += atks['re'][j]
								* (1 + (cmb[i]['num'] - 3) * 0.25)
								* (1 + (dm['cmb']['sum'] - 1) * 0.25)
								* Math.pow(1.5, atks['mlb'][j])
								* sk['re'];
    					}
    				}
    			}
    		}
    	}
    	//sum
    	for (var i=1; i<=5; i++) {	//各属性の合計を作っている。
    		for (var j=1; j<=6; j++) { //攻撃する人
    			if (i == atks['main'][j]) {
    				dm['dm']['sum'][i] += dm['dm'][j]['main'];
    			}
    			if (i == atks['sub'][j]) {
    				dm['dm']['sum'][i] += dm['dm'][j]['sub'];
    			}
    		}
    		dm['dm']['sum']['dm'] += dm['dm']['sum'][i];
    	}
    	for (var i=1; i<=6; i++) { //回復合計生成
    		dm['dm']['sum'][6] += dm['dm'][i]['re'];
    	}
    	
    	return dm;
    }

    function setDm(dm, atks){
    	//メイン属性のダメージを示す
    	var hs = '<th>メイン属性</th>';
    	for (var i=1; i<=6; i++) {
    		var bgc = '';
    		if (1 == atks['main'][i]) bgc = 'bgc_hi';
    		else if (2 == atks['main'][i]) bgc = 'bgc_mz';
    		else if (3 == atks['main'][i]) bgc = 'bgc_ki';
    		else if (4 == atks['main'][i]) bgc = 'bgc_hk';
    		else if (5 == atks['main'][i]) bgc = 'bgc_ym';
    		hs += '<td class='+bgc+'>'+Math.round(dm['dm'][i]['main'])+'</td>';
    	}
    	$('#each_main').html(hs);
    	//サブ属性のダメージを示す
    	hs = '<th>サブ属性</th>';
    	for (var i=1; i<=6; i++) {
    		var bgc = '';
    		if (6 > atks['sub'][i]) {
	    		if (1 == atks['sub'][i]) bgc = 'bgc_hi';
	    		else if (2 == atks['sub'][i]) bgc = 'bgc_mz';
	    		else if (3 == atks['sub'][i]) bgc = 'bgc_ki';
	    		else if (4 == atks['sub'][i]) bgc = 'bgc_hk';
	    		else if (5 == atks['sub'][i]) bgc = 'bgc_ym';
	    		hs += '<td class='+bgc+'>'+Math.round(dm['dm'][i]['sub'])+'</td>';
	    	} else {
	    		hs += '<td>-</td>';
	    	}
    	}
    	$('#each_sub').html(hs);
    	//回復量を示す
    	hs = '<th>回復</th>';
    	for (var i=1; i<=6; i++) {
	    	hs += '<td class=bgc_kh>'+Math.round(dm['dm'][i]['re'])+'</td>';
    	}
    	$('#each_re').html(hs);
    	//下段
    	hs = '<th>各属性合計</th>';
    	hs += '<td class="bgc_hi">'+Math.round(dm['dm']['sum'][1])+'</td>';    	
    	hs += '<td class="bgc_mz">'+Math.round(dm['dm']['sum'][2])+'</td>';
    	hs += '<td class="bgc_ki">'+Math.round(dm['dm']['sum'][3])+'</td>';
    	hs += '<td class="bgc_hk">'+Math.round(dm['dm']['sum'][4])+'</td>';
    	hs += '<td class="bgc_ym">'+Math.round(dm['dm']['sum'][5])+'</td>';
    	hs += '<td class="bgc_kh">'+Math.round(dm['dm']['sum'][6])+'</td>';
    	$('#each_sum').html(hs);
    	//合計ダメージ
    	$('#dm_sum').html('合計 '+Math.round(dm['dm']['sum']['dm'])+' ダメージ');
    	
    	//
    	hs = '<th>コンボ数</th>';
    	hs += '<td class="bgc_hi">'+dm['cmb']['hi']+'</td>';
    	hs += '<td class="bgc_mz">'+dm['cmb']['mz']+'</td>';
    	hs += '<td class="bgc_ki">'+dm['cmb']['ki']+'</td>';
    	hs += '<td class="bgc_hk">'+dm['cmb']['hk']+'</td>';
    	hs += '<td class="bgc_ym">'+dm['cmb']['ym']+'</td>';
    	hs += '<td class="bgc_kh">'+dm['cmb']['ht']+'</td>';
    	$('#each_cmb').html(hs);
    	$('#cmb_sum').html('合計 '+dm['cmb']['sum']+' コンボ');
    }

	//覚醒の値、すべて0にする関数
    function awakensIni(num) {
    	$('select[name=2way' + num + ']').val(0);
		$('select[name=hi' + num + ']').val(0);
		$('select[name=mz' + num + ']').val(0);
		$('select[name=ki' + num + ']').val(0);
		$('select[name=hk' + num + ']').val(0);
		$('select[name=ym' + num + ']').val(0);
		$('select[name=ht' + num + ']').val(0);
		$('select[name=hir' + num + ']').val(0);
		$('select[name=mzr' + num + ']').val(0);
		$('select[name=kir' + num + ']').val(0);
		$('select[name=hkr' + num + ']').val(0);
		$('select[name=ymr' + num + ']').val(0);
		$('select[name=mlb' + num + ']').val(0);
		$('select[name=kilr' + num + ']').val(0);
    }

	//
	// toggle for combo && dir
	//
    $('#cmb_zone div').slideToggle();
    $('#cmb_zone span').css('transform', 'rotate(-90deg)');
    var cmb_tgl = false;

    $('#dir h4').on('click', function () {
    	$('#dir div').slideToggle();
    	$('#cmb_zone div').slideToggle();
    	if (!cmb_tgl) {
    		$('#dir span').css('transform', 'rotate(-90deg)');
    		$('#cmb_zone span').css('transform', 'rotate(0deg)');
    	} else {
    		$('#dir span').css('transform', 'rotate(0deg)');
    		$('#cmb_zone span').css('transform', 'rotate(-90deg)');
    	}
    	cmb_tgl = !cmb_tgl;
    });

    $('#cmb_zone h4').on('click', function () {
    	$('#dir div').slideToggle();
    	$('#cmb_zone div').slideToggle();
    	if (!cmb_tgl) {
    		$('#dir span').css('transform', 'rotate(-90deg)');
    		$('#cmb_zone span').css('transform', 'rotate(0deg)');
    	} else {
    		$('#dir span').css('transform', 'rotate(0deg)');
    		$('#cmb_zone span').css('transform', 'rotate(-90deg)');
    	}
    	cmb_tgl = !cmb_tgl;
    });

	//
	// ドロップの再生成ボタンの実装
	//

    $('#cmb_redrop').on('click', function () {
    	var get_tbl = getDropRate();
    	setBanmen(get_tbl);
    });

    function getDropRate() {
    	var hi = parseInt($('#hi_gene').val());
    	var mz = parseInt($('#mz_gene').val());
    	var ki = parseInt($('#ki_gene').val());
    	var hk = parseInt($('#hk_gene').val());
    	var ym = parseInt($('#ym_gene').val());
    	var ht = parseInt($('#ht_gene').val());

    	if (hi + mz + ki + hk + ym + ht < 100) {
    		ht = 100 - (hi + mz + ki + hk + ym);
    	} else if (hi + mz + ki + hk + ym + ht > 100) {
    		ht = 100 - (hi + mz + ki + hk + ym);
    		if (ht < 0) {
    			ht = 0;
    			ym = 100 - (hi + mz + ki + hk);
    			if (ym < 0) {
    				ym = 0;
    				hk = 100 - (hi + mz + ki);
    				if (hk < 0) {
    					hk = 0;
    					ki = 100 - hi - mz;
    					if (ki < 0) {
    						ki = 0;
    						mz = 100 - hi;
    						if (mz < 0) {
    							mz = 0;
    							hi = 100;
    						}
    					}
    				}
    			}
    		}
    	}

    	$('#hi_gene').val(hi);
    	$('#mz_gene').val(mz);
    	$('#ki_gene').val(ki);
    	$('#hk_gene').val(hk);
    	$('#ym_gene').val(ym);
    	$('#ht_gene').val(ht);

    	return {
    		'hi': hi, 'mz': mz, 'ki': ki, 'hk': hk, 'ym': ym, 'ht': ht,
    		'hip': parseInt($('#hi_pls').val()),
    		'mzp': parseInt($('#mz_pls').val()),
    		'kip': parseInt($('#ki_pls').val()),
    		'hkp': parseInt($('#hk_pls').val()),
    		'ymp': parseInt($('#ym_pls').val()),
    		'htp': parseInt($('#ht_pls').val())
    	};
    }

    function setBanmen(dp_tbl) {
    	for (var i = 0; i < msm.length; i++) {
    		for (var k = 1; k <= 5; k++) {
    			var dp = getADrop(dp_tbl);
    			var hs = '<img src=img/' + dp + 'A.png width=59 height=59>';
    			$('#' + msm[i] + k).html(hs);
    		}
    	}
    }

	//to get a drop that standard the setting table
    function getADrop(dp_tbl) {
    	var rd = rand(1, 100);
    	var rtn = '';
    	if (rd <= dp_tbl['hi']) {
    		if (dp_tbl['hip'] < rand(1, 100)) rtn = 'fire';
    		else rtn = 'firep';
    	} else if (rd <= dp_tbl['hi'] + dp_tbl['mz']) {
    		if (dp_tbl['mzp'] < rand(1, 100)) rtn = 'water';
    		else rtn = 'waterp';
    	} else if (rd <= dp_tbl['hi'] + dp_tbl['mz'] + dp_tbl['ki']) {
    		if (dp_tbl['kip'] < rand(1, 100)) rtn = 'tree';
    		else rtn = 'treep';
    	} else if (rd <= dp_tbl['hi'] + dp_tbl['mz'] + dp_tbl['ki'] + dp_tbl['hk']) {
    		if (dp_tbl['hkp'] < rand(1, 100)) rtn = 'light';
    		else rtn = 'lightp';
    	} else if (rd <= dp_tbl['hi'] + dp_tbl['mz'] + dp_tbl['ki'] + dp_tbl['hk'] + dp_tbl['ym']) {
    		if (dp_tbl['ymp'] < rand(1, 100)) rtn = 'dark';
    		else rtn = 'darkp';
    	} else {
    		if (dp_tbl['htp'] <= rand(1, 100)) rtn = 'heart';
    		else rtn = 'heartp';
    	}

    	return rtn;
    }

    function rand(min, max) {
		var num = Math.floor((Math.random() * ((max + 1) - min)) + min);
    	return parseInt(num);
    }
	//
	// 以下ドロップ操作
	//
    $('.banmen p').attr('draggable', 'true');
    $('.banmen p').addClass('movable');
    var drg = document.getElementsByClassName('movable');
	//ptagじゃないと動かせない。IMGタグでは動かせない

    var plc = {
    	'pos': '', 'fst_im': ''
    };

	//dragされる
    for (var i in drg) {
    	drg[i].ondragstart = function (e) {

    		e.dataTransfer.setDragImage(this.children[0], '59px', '59px');

    		plc['pos'] = this.id;
    		plc['fst_im'] = this.children[0];
    	};
    	//dropされる
    	drg[i].ondragover = function (e) {
    		e.preventDefault();

    		if (plc['pos'] != this.id) {
    			var im = document.getElementById(plc['pos']);
    			$('#' + plc['pos']).html(this.children[0]);
    			plc['pos'] = this.id;
    			$(this).html();
    		}
    	};
    	drg[i].ondrop = function (e) {
    		e.preventDefault();

    		$('#' + this.id).html(plc['fst_im']);
    	};
    }

	//
	//  caliculate combo
	//
    $('#cmb_calc').on('click', function () {
    	var cmb = banmenCmb();
		cmb = transformCmb(cmb);
    	//cmbを表にして結果を表示 -> ダメージを算出
		//console.log(cmb);
    	//攻撃力、回復力をもってくる
		var atks = getAtk();
		//console.log(atks);
		var sk = getLeadSkl();
		//console.log(sk);

    	var dm_ary = getDm(atks, cmb, sk);
    	//console.log(dm_ary);
    	//表とpタグに出力(ダメージ)
    	setDm(dm_ary, atks);

    });

    function banmenCmb() {
    	//cmb left and top is point
    	var bmn = getBanmen();
    	//{'bmn': [], 'pls':[]};
    	//banmen Combo
    	var cmb = bmnCmb(bmn);
    	//drop drop
    	var hs_cmb = cmb;
    	var hs_bmn = bmn;
    	var otosi = true;
    	while (otosi === true) {
    		hs_bmn = dropDrop(hs_bmn, hs_cmb);
    		hs_cmb = bmnCmb(hs_bmn);
    		var hs_cmb_length = 0;
    		for (var k in hs_cmb) {
    			hs_cmb_length++;
    		}
    		if (hs_cmb_length > 0) {
    			var cmb_length = 0;
    			for (var key in cmb) {
    				cmb_length++;
    			}
    			for (var ky in hs_cmb) {
    				cmb[cmb_length] = hs_cmb[ky];
    				cmb_length++;
    			}
    		} else {
    			otosi = false;
    		}
    	}
    	return cmb;
    }

    function getBanmen() {
    	var bmn_pls = { 'bmn': {}, 'pls': {} };
    	for (var i = 0; i < msm.length; i++) {
    		for (var k = 1; k <= 5; k++) {
    			var hs = $('#' + msm[i] + k).children('img').attr('src');
    			if (hs.substr(-10, 5) === '/fire') {
    				bmn_pls['bmn'][msm[i] + k] = 'hi';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === 'water') {
    				bmn_pls['bmn'][msm[i] + k] = 'mz';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === '/tree') {
    				bmn_pls['bmn'][msm[i] + k] = 'ki';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === 'light') {
    				bmn_pls['bmn'][msm[i] + k] = 'hk';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === '/dark') {
    				bmn_pls['bmn'][msm[i] + k] = 'ym';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === 'heart') {
    				bmn_pls['bmn'][msm[i] + k] = 'ht';
    				bmn_pls['pls'][msm[i] + k] = false;
    			} else if (hs.substr(-10, 5) === 'firep') {
    				bmn_pls['bmn'][msm[i] + k] = 'hi';
    				bmn_pls['pls'][msm[i] + k] = true;
    			} else if (hs.substr(-10, 5) === 'aterp') {
    				bmn_pls['bmn'][msm[i] + k] = 'mz';
    				bmn_pls['pls'][msm[i] + k] = true;
    			} else if (hs.substr(-10, 5) === 'treep') {
    				bmn_pls['bmn'][msm[i] + k] = 'ki';
    				bmn_pls['pls'][msm[i] + k] = true;
    			} else if (hs.substr(-10, 5) === 'ightp') {
    				bmn_pls['bmn'][msm[i] + k] = 'hk';
    				bmn_pls['pls'][msm[i] + k] = true;
    			} else if (hs.substr(-10, 5) === 'darkp') {
    				bmn_pls['bmn'][msm[i] + k] = 'ym';
    				bmn_pls['pls'][msm[i] + k] = true;
    			} else if (hs.substr(-10, 5) === 'eartp') {
    				bmn_pls['bmn'][msm[i] + k] = 'ht';
    				bmn_pls['pls'][msm[i] + k] = true;
    			}
    			//本当はプラスならtruefalseで分けて示したい
    		}
    	}
    	return bmn_pls;
    }

    function bmnCmb(bmn_p) {
    	var bmn = bmn_p['bmn'];
    	//var pls = bmn_p['pls'];
    	var combo = [];
    	var m = 0;
    	for (var i = 0; i < msm.length; i++) {
    		for (var k = 1; k <= 5; k++) { //tateのコメントの下に3(5-2)がある
    			//yoko
    			if (i < msm.length - 2 && bmn[msm[i] + k] != '') {
    				if (bmn[msm[i] + k] == bmn[msm[parseInt(i) + 1] + k] && bmn[msm[i] + k] == bmn[msm[parseInt(i) + 2] + k]) { //最低でも3個消し
    					combo[m] = [msm[i] + k, msm[parseInt(i) + 1] + k, msm[parseInt(i) + 2] + k];
    					if (i + 3 < msm.length) {
    						//4つけしか
    						if (bmn[msm[i] + k] == bmn[msm[parseInt(i) + 3] + k]) {
    							combo[m].push(msm[parseInt(i) + 3] + k);
    							//5tu
    							if (i + 4 < msm.length) {
    								if (bmn[msm[i] + k] == bmn[msm[parseInt(i) + 4] + k]) {
    									combo[m].push(msm[parseInt(i) + 4] + k);
    									//6tu
    									if (i + 5 < msm.length) {
    										if (bmn[msm[i] + k] == bmn[msm[parseInt(i) + 5] + k]) {
    											combo[m].push(msm[parseInt(i) + 5] + k);
    										}
    									}
    								}
    							}
    						}
    					}
    					m++;
    				}
    			}
    			//tate
    			if (k <= 3 && bmn[msm[i] + k] != '') {
    				if (bmn[msm[i] + k] == bmn[msm[i] + (parseInt(k) + 1)] && bmn[msm[i] + k] == bmn[msm[i] + (parseInt(k) + 2)]) { //最低でも3個消し
    					combo[m] = [msm[i] + k, msm[i] + (parseInt(k) + 1), msm[i] + (parseInt(k) + 2)];
    					if (parseInt(k) + 3 <= 5) { //5 あり
    						//4つけしか
    						if (bmn[msm[i] + k] == bmn[msm[i] + (parseInt(k) + 3)]) {
    							combo[m].push(msm[i] + (parseInt(k) + 3));
    							//5tu
    							if (parseInt(k) + 4 <= 5) { //5 あり
    								if (bmn[msm[i] + k] == bmn[msm[i] + (parseInt(k) + 4)]) {
    									combo[m].push(msm[i] + (parseInt(k) + 4));
    								}
    							}
    						}
    					}
    					m++;
    				}
    			}
    		}
    	}

    	return assumeCmb(bmn_p, combo);
    }

    function assumeCmb(bmn_p, combo) {
    	//comboには、combo[何コンボ目][座標]と入っている
    	var con_cmb = {};//0{zk:'', cmb:[]}
    	var cmb_num = 1;
    	//同じ座標を持つか
    	for (var i = 0; i < combo.length; i++) {
    		if (i == 0 && combo.length > 0) {
    			var pls = 0;
    			for (var m = 0; m < combo[i].length; m++) {
    				if (bmn_p['pls'][combo[i][m]]) pls++;
    			}
    			con_cmb[0] = { 'zk': bmn_p['bmn'][combo[0][0]], 'pls': pls, 'cmb': combo[0] };
    		} else {
    			var umu = { 'a': 0, 'umu': false };
    			for (var k = 0; k < combo[i].length && umu['umu'] === false; k++) {
    				//同じ座標がある時は、con_cmbにそれを追加
    				for (var a in con_cmb) {
    					for (var b in con_cmb[a]['cmb']) {
    						if (combo[i][k] == con_cmb[a]['cmb'][b]) {
    							umu['umu'] = true;
    							umu['a'] = a;
    						}
    					}
    				}
    			}
    			//どの座標も無い時は、con_cmbの新しい項目に追加
    			if (!umu['umu']) {
    				var pls = 0;
    				for (var m = 0; m < combo[i].length; m++) {
    					if (bmn_p['pls'][combo[i][m]]) pls++;
    				}
    				con_cmb[cmb_num] = { 'zk': bmn_p['bmn'][combo[i][0]], 'pls': pls, 'cmb': combo[i] };
    				cmb_num++;
    			} else {
    				//同じ座標がある時
    				for (var k = 0; k < combo[i].length; k++) {
    					//同じ座標がある時は、con_cmbにそれを追加
    					var need = true;
    					for (var b in con_cmb[umu['a']]['cmb']) {
    						if (combo[i][k] == con_cmb[umu['a']]['cmb'][b]) need = false;
    					}
    					if (need) {
    						con_cmb[umu['a']]['cmb'].push(combo[i][k]);
    						if (bmn_p['pls'][combo[i][k]]) con_cmb[umu['a']]['pls']++;
    					}
    				}
    			}
    		}
    	}

    	//{cmb:{zahyo}, zk:hi, pls: int}

    	var rtn_cmb = connectCombo(con_cmb);

    	return rtn_cmb;
    }

    function dropDrop(bmn, cmb) {
    	//erase drop
    	for (var kb in bmn['bmn']) {
    		for (var kc in cmb) {
    			for (var zh = 0; zh < cmb[kc]['cmb'].length; zh++) {
    				if (kb == cmb[kc]['cmb'][zh]) {
    					bmn['bmn'][kb] = '';
    					bmn['pls'][kb] = false;
    				}
    			}
    		}
    	}
    	//dropDrop
    	for (var i = 0; i < msm.length; i++) {
    		bmn = otosu(bmn, msm[i]);
    	}
    	return bmn;
    }

	//横3,横3と上と下でくっつく場合
    function connectCombo(cmb) {
    	var con_cmb = {};
    	var ng_con = []; //くっつく組み合わせ
    	for (var ky in cmb) {
    		for (var ky2 in cmb) {
    			if (ky != ky2 && cmb[ky]['zk'] == cmb[ky2]['zk']) {
    				for (var zh in cmb[ky]['cmb']) {
    					for (var zh2 in cmb[ky2]['cmb']) {
    						switch (cmb[ky]['cmb'][zh].substring(0, 1)) {
    							case 'A':
    								if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'B'
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'A'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    							case 'B':
    								if ((cmb[ky2]['cmb'][zh2].substring(0, 1) == 'A' || cmb[ky2]['cmb'][zh2].substring(0, 1) == 'C')
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'B'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    							case 'C':
    								if ((cmb[ky2]['cmb'][zh2].substring(0, 1) == 'B' || cmb[ky2]['cmb'][zh2].substring(0, 1) == 'D')
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'C'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    							case 'D':
    								if ((cmb[ky2]['cmb'][zh2].substring(0, 1) == 'C' || cmb[ky2]['cmb'][zh2].substring(0, 1) == 'E')
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'D'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    							case 'E':
    								if ((cmb[ky2]['cmb'][zh2].substring(0, 1) == 'D' || cmb[ky2]['cmb'][zh2].substring(0, 1) == 'F')
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'E'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    							case 'F':
    								if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'E'
										&& cmb[ky]['cmb'][zh].substring(1) == cmb[ky2]['cmb'][zh2].substring(1)) {
    									//yoko dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								} else if (cmb[ky2]['cmb'][zh2].substring(0, 1) == 'F'
										&& (parseInt(cmb[ky]['cmb'][zh].substring(1)) - 1 == cmb[ky2]['cmb'][zh2].substring(1) || parseInt(cmb[ky]['cmb'][zh].substring(1)) + 1 == cmb[ky2]['cmb'][zh2].substring(1))) {
    									//tate dousi
    									ng_con = tyohukuHazusi(ky, ky2, ng_con);
    								}
    								break;
    						}
    					}
    				}
    			}
    		}
    	}

    	//ng_con is doubling
    	//[0,1] , [0,2] and [1,3] -> [0,1,2,3] && [0,1] , [0,2] and [1,2] -> [0,1,2]
    	//関数に入れて回す->繋げたら即returnして、もう一度最初から。繋がらない時は脱出
    	var mtm_ng = ng_con;
    	var ary = [0, 1];
    	while (ary[0] != ary[1]) {
    		ary = dbrEscape(mtm_ng);
    		if (ary[0] != ary[1]) mtm_ng = matomeCon(mtm_ng, ary);
    	}

    	var num = 0;
    	var fit_key = false;
    	for (var k in cmb) {
    		fit_key = false;
    		for (var i = 0; i < mtm_ng.length; i++) {
    			for (var d = 0; d < mtm_ng[i].length; d++) {
    				if (k == mtm_ng[i][d]) {
    					//keyを合わせたら、cmb[k]['cmb']の値を連結
    					fit_key = true;
    				}
    			}
    		}
    		//keyが合わなければ、con_cmbにそのまま代入 
    		if (!fit_key) {
    			con_cmb[num] = cmb[k];
    			num++;
    		}
    	}
    	for (var i = 0; i < mtm_ng.length; i++) {
    		for (var d = 0; d < mtm_ng[i].length; d++) {
    			if (d == 0) con_cmb[num] = cmb[mtm_ng[i][d]];
    			else {
    				for (var e = 0; e < cmb[mtm_ng[i][d]]['cmb'].length; e++) {
    					con_cmb[num]['cmb'].push(cmb[mtm_ng[i][d]]['cmb'][e]);
    				}
    				con_cmb[num]['pls'] += parseInt(cmb[mtm_ng[i][d]]['pls']);
    			}
    		}
    		num++;
    	}
    	return con_cmb;
    }

    function tyohukuHazusi(k, k2, grp) {
    	var tyohuku = false;
    	for (var i = 0; i < grp.length; i++) {
    		if (grp[i][0] == k && grp[i][1] == k2) tyohuku = true;
    		else if (grp[i][0] == k2 && grp[i][1] == k) tyohuku = true;
    	}
    	if (!tyohuku) {
    		grp[grp.length] = [k, k2];
    	}
    	return grp;
    }

	//組み合わせるべきng_conのグループを探す
    function dbrEscape(con) {
    	for (var i = 0; i < con.length; i++) {
    		for (var m = i + 1; m < con.length; m++) {
    			for (var k = 0; k < con[i].length; k++) {
    				for (var n = 0; n < con[m].length; n++) {
    					if (i != m && con[i][k] == con[m][n]) {
    						return [i, m];
    					}
    				}
    			}
    		}
    	}
    	//組み合わせるべきものが無い時
    	return [0, 0];
    }

    function matomeCon(con, ary) {
    	var dbr = false;
    	var adar = [];
    	for (var n = 0; n < con[ary[1]].length; n++) {
    		dbr = false;
    		for (var k = 0; k < con[ary[0]].length; k++) {
    			if (con[ary[1]][n] == con[ary[0]][k]) {
    				dbr = true;
    			}
    		}
    		if (!dbr) adar.push(con[ary[1]][n]);
    	}
    	for (var m = 0; m < adar.length; m++) {
    		con[ary[0]].push(adar[m]);
    	}
    	con.splice(ary[1], ary[1]);
    	return con;
    }

    function otosu(bmn, char) {
    	for (var i = 0; i < 5; i++) { // 5 is tate
    		for (var k = 5; k > 1; k--) {
    			if (bmn['bmn'][char + k] == '') {
    				//blank exchange with drop or blank
    				bmn['bmn'][char + k] = bmn['bmn'][char + (parseInt(k) - 1)];
    				bmn['pls'][char + k] = bmn['pls'][char + (parseInt(k) - 1)];
    				bmn['bmn'][char + (parseInt(k) - 1)] = '';
    				bmn['pls'][char + (parseInt(k) - 1)] = false;
    			}
    		}
    	}

    	return bmn;
    }

    function transformCmb(cmb) {
    	//0:{'cmb':['A1','B1','C1'], 'pls':2, 'zk': 'hi'}
    	//以下に変形
		var t_cmb = {
			'num':0,
			'rt':{1:0, 2:0, 3:0, 4:0, 5:0},
			1:{'zk':0, 'num':0, 'pls':0},
			2:{'zk':0, 'num':0, 'pls':0},
			3:{'zk':0, 'num':0, 'pls':0},
			4:{'zk':0, 'num':0, 'pls':0},
			5:{'zk':0, 'num':0, 'pls':0},
			6:{'zk':0, 'num':0, 'pls':0},
			7:{'zk':0, 'num':0, 'pls':0},
			8:{'zk':0, 'num':0, 'pls':0},
			9:{'zk':0, 'num':0, 'pls':0},
			10:{'zk':0, 'num':0, 'pls':0}
		};
		var zk = ['', 'hi', 'mz', 'ki', 'hk', 'ym', 'ht'];
		var sej = 1;
    	for (var i in cmb) {
    		t_cmb['num']++;
    		t_cmb[sej]['num'] = cmb[i]['cmb'].length;
    		t_cmb[sej]['pls'] = cmb[i]['pls'];
    		for (var a = 1; a < zk.length; a++) {
    			if (cmb[i]['zk'] == zk[a]) t_cmb[sej]['zk'] = a;
    		}
    		if (t_cmb[sej]['num'] >= 6) { //列形成可能
				var rt_dbr = false;
    			for (var d = 0; d < 5 && rt_dbr === false; d++) {
    				var rt_ary = [false, false, false, false, false, false];
    				for (var c = 0; c < cmb[i]['cmb'].length; c++) {
   						for (var b = 0; b < msm.length; b++) {
    						if (msm[b] + (parseInt(d) + 1) == cmb[i]['cmb'][c]) rt_ary[b] = true;
    					}
    				}
    				if (rt_ary[0] && rt_ary[1] && rt_ary[2] && rt_ary[3] && rt_ary[4] && rt_ary[5]) {
    					t_cmb['rt'][t_cmb[sej]['zk']]++;
						rt_dbr = true;
    				}
    			}
    		}
    		sej++;
    	}

    	return t_cmb;
    }

	function awList(num, aw_ary){
		for (var key in aw_ary) {
			aw_list[key][num - 1] = aw_ary[key];
		}
		var aw_inputer = {
			'hidec':0, 'mzdec':0, 'kidec':0, 'hkdec':0, 'ymdec':0,
			'hi':0, 'mz':0, 'ki':0, 'hk':0, 'ym':0, 'ht':0,
			'hir':0, 'mzr':0, 'kir':0, 'hkr':0, 'ymr':0,
			'2way':0, 'skb':0, 'mlb':0, 'kilr':0, 'huin':0,
			'jm':0, 'dk':0,'gls':0, 'birs':0, 'bire':0, 'yb':0,'re':0
		};
		for (var key in aw_inputer) {
			for (var i=0; i < aw_list[key].length; i++) {
				aw_inputer[key] += aw_list[key][i];
			}
			$('#aw_'+key).html(aw_inputer[key]);
		}
	}

	function statusChange(num, hp, atk, re){
		status_list['hp'][num - 1] = hp;
		status_list['atk'][num - 1] = atk;
		status_list['re'][num - 1] = re;
		
		var st_sum = {'atk':0, 'hp':0, 're':0};
		for (var i=0; i < status_list['atk'].length; i++) {
			st_sum['atk'] += status_list['atk'][i];
			st_sum['hp'] += status_list['hp'][i];
			st_sum['re'] += status_list['re'][i];
		}
		$('#status_atk').html(st_sum['atk']);
		$('#status_hp').html(st_sum['hp']);
		$('#status_re').html(st_sum['re']);
	}

    function reqAnim(tmstmp) {
    	var tm = Date.now() - sttm;
    	$('.bk').css('width', 4*tm+'px');
    	$('.bk').css('height', 4*tm + 'px');
    	$('.bk').css('top', (-2 * tm) + 'px');
    	$('.bk').css('left', (-2 * tm) + 'px');
    	if (4*tm < window.innerWidth) {
    		requestAnimationFrame(reqAnim);
    	} else {
    		var num = $('.bk').attr('data000');
    		$('#nm' + num).html('-指定なし-');
    		$('body').css('position', 'relative');
    		$('body').append('<div class=bk data000=' + num + '></div>');
    		$('.bk').css('width', window.innerWidth + 'px');
    		$('.bk').css('height', window.innerHeight*2 + 'px');
    		$('.bk').css('top', 0 + 'px');
    		$('.bk').css('left', 0 + 'px');
    		listMons(1, num);
    		cancelAnimationFrame(reqAnim);
    	}
    }
});

